Repository: KDE/ktutorial
Catalog: ktutorial-library/po/*.po
Languages: es

# @action:inmenu
source: Tutorials...
es: Tutoriales...

# @info/plain Plain text in a QTextEdit
source: Look at me! I am the text area!
es: ¡Mírame! ¡Soy el área de texto!

# @info/plain
source: Using the tutorials
es: Utilización de los tutoriales

# @info/plain
source: This tutorial shows how the tutorial system works
es: Este tutorial muestra cómo funciona el sistema de tutoriales

# @info
source: <para>Welcome to the tutorial to learn how to use tutorials ;)</para><para>But, what is a tutorial? A tutorial is a little guide to help you to learn how to use an application. For example, it shows you how some feature works, or how to accomplish some task.</para>
es: <para>Bienvenido al tutorial para aprender cómo utilizar los tutoriales :)</para><para>Pero, ¿qué es un tutorial? Un tutorial es una pequeña guía para ayudarte a aprender cómo usar una aplicación. Por ejemplo, te muestra cómo funciona cierta característica, o cómo llevar a cabo cierta tarea.</para>

# @action
source: Continue
es: Continuar

# @info
source: <para>A tutorial is composed of several steps. Each step contains a bit of information.</para><para>There are several ways to advance from one step to another. For example, clicking on the button below the tutorial will change to the next step.</para>
es: <para>Un tutorial se compone de varios pasos. Cada paso contiene un poco de información.</para><para>Hay varias formas de avanzar desde un paso a otro. Por ejemplo, haciendo click en el botón de debajo el tutorial cambiará al siguiente paso.</para>

# @info
source: <para>In other steps you may have more than one option to select. This can be used, for example, to follow one path or another in the tutorial, skip some part of the tutorial, etcetera. Which option do you prefer?</para>
es: <para>En otros pasos puedes tener más de una opción para seleccionar. Esto puede usarse, por ejemplo, para seguir un camino u otro en el tutorial, saltarse cierta parte del tutorial, etcétera. ¿Qué opción prefieres?</para>

# @action
source: Option 1
es: Opción 1

# @action
source: Option 2
es: Opción 2

# @info
source: <para>You have selected <emphasis>%1</emphasis>. Don't worry, as this is just an example, selecting one option or the other makes no difference.</para><para>In the next step you will learn the last way to advance from one step to another. To show this to you I will open a new window where text can be written.</para>
es: <para>Has seleccionado <emphasis>%1</emphasis>. No te preocupes, dado que esto es sólo un ejemplo, no hay ninguna diferencia entre seleccionar una opción u otra.</para><para>En el siguiente paso aprenderás la última forma de avanzar de un paso a otro. Para mostrártelo abriré una nueva ventana en la que puede escribirse texto.</para>

# @info
source: <para>Do you see the new window that has appeared? Yes, the one that says that it is the text area. Well, the last way to advance from one step to another is just doing what you are asked for.</para><para>In this case, empty the text area erasing all its text and once you have done it look again to the tutorial.</para>
es: <para>¿Ves la nueva ventana que ha aparecido? Sí, la que dice que es el área de texto. Bien, la última forma de avanzar de un paso a otro es simplemente haciendo lo que se te pide.</para><para>En este caso, vacía el área de texto borrando todo su texto y una vez lo hayas hecho fíjate de nuevo en el tutorial.</para>

# @info
source: <para>Do you see? You are in a new step, but you didn't tell the tutorial to continue to the next step, and neither you had to select between several options. The tutorial advanced automatically when you erased the text as requested. This will be the most common way to advance from one step to another.</para>
es: <para>¿Ves? Estás en un nuevo paso, pero no le dijiste al tutorial que continuase al siguiente paso, ni tampoco tuviste que seleccionar entre varias opciones. El tutorial avanzó automáticamente cuando borraste el texto como se te pidió. Ésta será la forma más común de avanzar de un paso a otro.</para>

# @info
source: <para>Sometimes, a tutorial may provide a link to a <emphasis>widget</emphasis> (an element of the graphical user interface, like a button). For example, <link url="widget:usingKTutorialTextEdit">this is a link to the text area</link>.</para><para>When you click on a link to a widget, the widget is highlighted to help you to spot it. If you click again on it, the highlighting will be stopped. In this example it is pretty clear what the text area refers to, but it can be useful in tutorials for more complex applications.</para><para>Ok, close the window with the text area to continue with the tutorial.</para>
es: <para>En algunos casos un tutorial podría proveer un enlace a un <emphasis>widget</emphasis> (un elemento de la interfaz gráfica de usuario, como un botón). Por ejemplo, <link url="widget:usingKTutorialTextEdit">esto es un enlace al área de texto</link>.</para><para>Cuando haces click en un enlace a un widget, el widget se remarca para que te sea más fácil encontrarlo. Si haces click en él de nuevo, dejará de remarcarse. En este ejemplo está bastante claro a qué se refiere el área de texto, pero puede ser útil en tutoriales para aplicaciones más complejas.</para><para>Bien, ahora cierra la ventana con el área de texto para seguir con el tutorial.</para>

# @info
source: <para>You may have noticed that the tutorial window has no border. Does that mean that it can't be moved? Not at all. It can be dragged using the mouse like any other window, but pressing in a different place. Let's see how.</para><para>Above these paragraphs you can see an empty space, next to the button at the corner. Press with the left button of your mouse on that empty space. Just press, don't release the mouse button yet.</para>
es: <para>Puede que te hayas dado cuenta de que la ventana del tutorial no tiene borde. ¿Eso significa que no se puede mover? En absoluto. Puede arrastrarse utilizando el ratón como cualquier otra ventana, pero presionando en un lugar distinto. Veamos cómo.</para><para>Sobre estos párrafos puedes ver un espacio vacío, al lado del botón de la esquina. Presiona con el botón izquierdo de tu ratón en dicho espacio vacío. Simplemente presiona, no sueltes el botón del ratón aún.</para>

# @info
source: <para>Now, and without releasing the button, move the mouse and the window will be moved. Once you release the button, the window will be kept in the place it was. Of course, you can move it again dragging it like you have just done.</para>
es: <para>Ahora, y sin soltar el botón, mueve el ratón y la ventana se moverá. Cuando sueltes el botón, la ventana permanecerá en la posición en la que estaba. Por supuesto, puedes moverla de nuevo arrastrándola como acabas de hacer.</para>

# @info
source: <para>And that's all. You can now close the tutorial. In fact, you could have closed the tutorial in any other of the previous steps, but if you do that when the tutorial is started again it won't remember what you did. It will start from the beginning again.</para><para>But how do you close the tutorial? Well, do you see that button above this text, in the corner, with an icon that looks like a close icon? Do you guess what it does? ;) Just click on it and you will return to the tutorial selection dialog. Bye!</para>
es: <para>Y eso es todo. Ahora ya puedes cerrar el tutorial. De hecho, podrías haber cerrado el tutorial en cualquiera de los pasos previos, pero si lo haces cuando el tutorial empiece de nuevo no recordará lo que hiciste. Empezará desde el principio otra vez.</para><para>¿Pero cómo puedes cerrar el tutorial? Bien, ¿ves ese botón sobre este texto, en la esquina, con un icono que parece un icono de cerrar? ¿Adivinas qué hace? ;) Simplemente haz click en él y volverás al diálogo de selección de tutoriales. ¡Hasta luego!</para>

# @item:inmenu
source: Highlight
es: Remarcar

# @item:inmenu
source: Stop highlighting
es: Dejar de remarcar

# @title:column
source: Tutorials name
es: Nombres de los tutoriales

# @title:window
source: Tutorial manager
es: Gestor de tutoriales

# @action:button Used to start a tutorial
source: Start
es: Empezar

# @info:tooltip
source: Start the selected tutorial
es: Empezar el tutorial seleccionado

# @info:whatsthis
source: Start the selected tutorial
es: Empezar el tutorial seleccionado

# NAME OF TRANSLATORS
source: Your names
es: Daniel Calviño Sánchez

# EMAIL OF TRANSLATORS
source: Your emails
es: danxuliu@gmail.com
