Repository: KDE/ktutorial
Catalog: ktutorial-editor/po/*.po
Languages: es

# @action
source: Set reaction trigger type
es: Establecer el tipo de activador de la reacción

# @action
source: Set reaction option name
es: Establecer el nombre de la opción de la reacción

# @action
source: Set reaction condition to wait for
es: Establecer la condición por la que esperar de la reacción

# @action
source: Set reaction response type
es: Establecer el tipo de respuesta de la reacción

# @action
source: Set reaction next step id
es: Establecer el identificador del siguiente paso de la reacción

# @action
source: Set reaction custom code
es: Establecer el código propio de la reacción

# @action
source: Set step id
es: Establecer el identificador del paso

# @action
source: Set step text
es: Establecer el texto del paso

# @action
source: Set step setup code
es: Establecer el código de inicialización del paso

# @action
source: Set step tear down code
es: Establecer el código de finalización del paso

# @action
source: Add reaction
es: Añadir reacción

# @action
source: Remove reaction
es: Eliminar reacción

# @action
source: Set tutorial name
es: Establecer el nombre del tutorial

# @action
source: Set tutorial description
es: Establecer la descripción del tutorial

# @action
source: Set tutorial license
es: Establecer la licencia del tutorial

# @action
source: Set tutorial setup code
es: Establecer el código de inicialización del tutorial

# @action
source: Set tutorial tear down code
es: Establecer el código de finalización del tutorial

# @action
source: Add step
es: Añadir paso

# @action
source: Remove step
es: Eliminar paso

# @action
source: Set information...
es: Establecer información...

# @info:status
source: Set the name and description of the tutorial.
es: Establecer el nombre y la descripción del tutorial.

# @action
source: Set license...
es: Establecer licencia...

# @info:status
source: Set the license text of the tutorial.
es: Establecer el texto de licencia del tutorial.

# @action
source: Set setup code...
es: Establecer código de inicialización...

# @info:status
source: Set the custom code to be executed when the tutorial starts.
es: Establecer el código propio para ser ejecutado cuando comience el tutorial.

# @action
source: Set tear down code...
es: Establecer el código de finalización...

# @info:status
source: Set the custom code to be executed when the tutorial finishes.
es: Establecer el código propio para ser ejecutado cuando termine el tutorial.

# @action
source: Add step...
es: Añadir paso...

# @info:status
source: Add a new step to the tutorial.
es: Añadir un nuevo paso al tutorial.

# @action
source: Set step data...
es: Establecer datos del paso...

# @info:status
source: Set the name and text of the currently selected step.
es: Establecer el nombre y el texto del paso seleccionado actualmente.

# @info:status
source: Set the custom code to be executed when the tutorial passes to the currently selected step.
es: Establecer el código propio para ser ejecutado cuando el tutorial cambie al paso seleccionado actualmente.

# @info:status
source: Set the custom code to be executed when the tutorial changes from the currently selected step to another step.
es: Establecer el código propio para ser ejecutado cuando el tutorial cambie del paso seleccionado actualmente a otro paso.

# @info:status
source: Removes the currently selected step from the tutorial.
es: Elimina del tutorial el paso seleccionado actualmente.

# @action
source: Add reaction...
es: Añadir reacción...

# @info:status
source: Add a new reaction to the selected step.
es: Añadir una nueva reacción al paso seleccionado actualmente.

# @action
source: Set reaction data...
es: Establecer datos de la reacción...

# @info:status
source: Set the trigger and the response of the currently selected reaction.
es: Establecer el activador y la respuesta de la reacción seleccionada actualmente.

# @info:status
source: Removes the currently selected reaction from its step.
es: Elimina de su paso la reacción seleccionada actualmente.

# @label
source: The tutorial has been modified.<nl/>Do you want to save your changes or discard them?
es: El tutorial ha sido modificado.<nl/>¿Deseas guardar los cambios o descartarlos?

# @title:window
source: Close tutorial
es: Cerrar tutorial

# @label
source: There was a problem when trying to open the file:<nl/>%1
es: Ocurrió un problema cuando se intentaba abrir el archivo:<nl/>%1

# @title:window
source: File could not be read
es: El archivo no pudo leerse

# @label
source: There was a problem when trying to load the tutorial:<nl/>%1
es: Ocurrió un problema cuando se intentaba cargar el tutorial:<nl/>%1

# @title:window
source: Tutorial could not be loaded
es: El tutorial no pudo cargarse

# @action
source: Export...
es: Exportar...

# @info:status
source: Exports the tutorial to a script.
es: Exporta el tutorial a un script.

# @title
source: Open Tutorial
es: Abrir tutorial

# @item:inlistbox A KFileDialog filter
source: *.xml|XML file
es: *.xml|Archivo XML

# @label
source: There was a problem when trying to save the tutorial:<nl/>%1
es: Ocurrió un problema cuando se intentaba guardar el tutorial:<nl/>%1

# @title:window
source: Tutorial could not be saved
es: El tutorial no pudo guardarse

# @title
source: Save Tutorial
es: Guardar tutorial

# @title
source: Export Tutorial
es: Exportar tutorial

# @label
source: There was a problem when trying to save the exported tutorial:<nl/>%1
es: Ocurrió un problema cuando se intentaba guardar el tutorial exportado:<nl/>%1

# @title:window
source: Exported tutorial could not be saved
es: El tutorial exportado no pudo guardarse

# @title
source: Edit tutorial
es: Editar tutorial

# @title
source: Edit step
es: Editar paso

# @title
source: Edit reaction
es: Editar reacción

source: New file
es: Nuevo archivo

source: %1 [not saved]
es: %1 [no guardado]

# @title
source: KTutorial editor
es: Editor para KTutorial

# @title
source: An editor to create tutorials for <application>KTutorial</application>.
es: Un editor para crear tutoriales para <application>KTutorial</application>.

# @info:credit
source: Main developer
es: Desarrollador principal

# @info:shell
source: The tutorial to open
es: El tutorial a abrir

# @info/plain
source: A file was expected, but '%1' is a folder
es: Se esperaba un archivo, pero '%1' es un directorio

# @item:inlistbox A KFileDialog filter
source: *.js|Javascript file
es: *.js|Archivo Javascript

source: XML document is not well formed: %1, line %2, column %3
es: El documento XML no está bien formado: %1, línea %2, columna %3

source: Unknown root element, <emphasis>tutorial</emphasis> expected, got: %1
es: Elemento raíz desconocido, se esperaba <emphasis>tutorial</emphasis>, se encontró: %1

# @action
source: Test tutorial
es: Probar tutorial

# @info:status
source: Starts the tutorial in the target application.
es: Empieza el tutorial en la aplicación objetivo

# @action
source: Test tutorial from current step
es: Probar tutorial desde el paso actual

# @info:status
source: Starts the tutorial in the target application from the current step.
es: Empieza el tutorial en la aplicación objetivo desde el paso actual

source: Basic concepts
es: Conceptos básicos

source: This tutorial shows how to design a basic tutorial for the KTutorial test application.
es: Este tutorial muestra cómo diseñar un tutorial básico para la aplicación de prueba de KTutorial.

# @info
source: <para>Welcome to the tutorial to learn the basic concepts in <application>KTutorial editor</application>.</para> <para>When you end this tutorial you will have written a tutorial for the KTutorial test application that teaches the user how to clear the text area. First it will ask the user to write something in the text area, and then clear it using a menu item or a toolbar button.</para> <para>We will start setting the tutorial information. This information is shown to the user in the tutorial selection dialog as a way to know the purpose of a tutorial before starting it.</para> <para>Click the <link url="widget:setTutorialInformationToolButton"><interface>Set information</interface></link> direct access in the dock panels, or in <interface>Edit|Tutorial|Set information...</interface>.</para>
es: <para>Bienvenido al tutorial para aprender los conceptos básicos de <application>KTutorial editor</application>.</para> <para>Cuando termines este tutorial habrás escrito un tutorial para la aplicación de prueba de KTutorial que enseña al usuario cómo limpiar el área de texto. Primero le pedirá al usuario que escriba algo en el área de texto, y luego que la limpie utilizando un elemento del menú o un botón de la barra de herramientas.</para> <para>Comenzaremos por establecer la información del tutorial. La información se muestra al usuario en el diálogo de selección de tutoriales para que pueda saber el objetivo del tutorial antes de empezarlo.</para> <para>Haz click en el acceso directo <link url="widget:setTutorialInformationToolButton"><interface>Establecer información</interface></link> de los paneles de acoplamiento, o en <interface>Editar|Tutorial|Establecer información...</interface>.</para>

# @info
source: Now, set the name of the tutorial to "Example" and its description to "Example tutorial" and accept the dialog clicking in <link url="widget:okButton"><interface>Ok</interface> button</link>.
es: Ahora, pon "Ejemplo" como nombre del tutorial y "Tutorial de ejemplo" como descripción y acepta el diálogo haciendo click en el <link url="widget:okButton">botón <interface>Aceptar</interface></link>.

# @info
source: <para>Now it is time to add the first step of the tutorial. Every tutorial must have a step called "start", so KTutorial can know where the tutorial starts.</para> <para>Click the <link url="widget:addStepToolButton"><interface>Add step</interface></link> direct access in the dock panels, or in <interface>Edit|Step|Add step...</interface>.</para>
es: <para>Ahora es el momento de añadir el primer paso del tutorial. Todo tutorial debe tener un paso llamado "start" (comienzo, en inglés), de modo que KTutorial pueda saber dónde comienza el tutorial.</para> <para>Haz click en el acceso directo <link url="widget:addStepToolButton"><interface>Añadir paso</interface></link> de los paneles de acoplamiento, o en <interface>Editar|Paso|Añadir paso...</interface>.</para>

# @info
source: <para>Set the id of the step to <emphasis>start</emphasis> and the text to <emphasis>Write &lt;emphasis&gt;Hello world!&lt;/emphasis&gt; in the text area.</emphasis>, then accept the dialog.</para> <para><emphasis>&lt;emphasis&gt;</emphasis> is a special markup that is not shown in the tutorial. Instead, the text between <emphasis>&lt;emphasis&gt;</emphasis> and <emphasis>&lt;/emphasis&gt;</emphasis> will be written in italics.</para>
es: <para>Pon <emphasis>start</emphasis> como identificador del paso y <emphasis>Escribe &lt;emphasis&gt;¡Hola mundo!&lt;/emphasis&gt; en el área de texto.</emphasis> como texto, luego acepta el diálogo.</para> <para><emphasis>&lt;emphasis&gt;</emphasis> es un marcado especial que no se muestra en el tutorial. En cambio, el texto entre <emphasis>&lt;emphasis&gt;</emphasis> y <emphasis>&lt;/emphasis&gt;</emphasis> estará escrito en cursiva.</para>

# @info
source: <para>The start step will wait until the user writes <emphasis>Hello world!</emphasis> in the text area of the KTutorial test application.</para> <para>For the step to do that we have to add a reaction to it. To add a reaction, in the <link url="widget:centralTreeView">tutorial tree view</link> select the step to add the reaction to and click the <link url="widget:addReactionToolButton"><interface>Add reaction</interface></link> direct access in the dock panels, or in <interface>Edit|Reaction|Add reaction...</interface>.</para>
es: <para>El paso start esperará hasta que el usuario escriba <emphasis>¡Hola mundo!</emphasis> en el área de texto de la aplicación de prueba de KTutorial.</para> <para>Para que el paso haga eso debemos añadirle una reacción. Para añadir una reacción, en la <link url="widget:centralTreeView">vista en árbol del tutorial</link> selecciona el paso al que añadir la reacción y haz click en el acceso directo <link url="widget:addReactionToolButton"><interface>Añadir reacción</interface></link> de los paneles de acoplamiento, o en <interface>Edit|Reacción|Añadir reacción...</interface>.</para>

# @info
source: <para>A reaction can be triggered when the user selects some option or when a condition is met, but not both in the same reaction (although several reactions can be added to the same step).</para> <para>We want the step to react when something happens, that is, when a condition is met, so select the <link url="widget:triggerConditionRadioButton"><interface>condition met</interface> radio button</link>.</para>
es: <para>Una reacción puede activarse cuando el usuario selecciona cierta opción o cuando se cumple cierta condición, pero no ambas en la misma reacción (aunque pueden añadirse varias reacciones al mismo paso).</para> <para>Queremos que el paso reaccione cuando ocurra algo, es decir, cuando se cumpla una condición, así que selecciona el <link url="widget:triggerConditionRadioButton">botón <interface>condición cumplida</interface></link>.</para>

# @info
source: <para>Once the <interface>condition met</interface> button is selected we can add a new condition to the reaction. Only one condition can be added to each reaction, although the condition can be composed of other conditions.</para> <para>Click <link url="widget:addButton"><interface>Add...</interface> button</link> to show the dialog to add new conditions.</para>
es: <para>Una vez se selecciona el botón <interface>condición cumplida</interface> ya podemos añadir una nueva condición a la reacción. Sólo se puede añadir una condición a cada reacción, aunque la condición puede estar compuesta por otras condiciones.</para> <para>Haz click en el <link url="widget:addButton">botón <interface>Añadir...</interface></link> para mostrar el diálogo para añadir nuevas condiciones.</para>

# @info
source: <para>In the dialog you can select the type of condition to wait for.</para> <para>There are simple and composed conditions. Simple conditions wait for something specific. Composed conditions wait for other conditions to be met.</para> <para>In this case, as it will be explained later, we want to wait for a signal, so select "The specified signal is emitted" in the <link url="widget:waitForTypeComboBox">combobox</link> and accept the dialog.</para>
es: <para>En el diálogo puedes seleccionar el tipo de condición por la que esperar.</para> <para>Hay condiciones simples y compuestas. Las simples esperan por algo específico. Las compuestas esperan a que se cumplan otras condiciones.</para> <para>En este caso, como se explicará más adelante, queremos esperar por una señal, así que selecciona "Se emite la señal especificada" en la <link url="widget:waitForTypeComboBox">lista desplegable</link> y acepta el diálogo.</para>

# @info
source: <para>Just adding the condition is not enough to define it. Which signal will it wait for? Emitted by which object? Simple conditions have to be edited after being added to set its parameters.</para> <para>Composed conditions, on the other hand, have no parameters to be set. They are defined by its own type and its child conditions.</para> <para>To edit a condition, select it in the <link url="widget:waitForTreeView">condition tree</link> and then click the <link url="widget:editButton"><interface>Edit...</interface> button</link>.</para>
es: <para>Únicamente añadir la condición no es suficiente para definirla. ¿Por qué señal esperará? ¿Emitida por qué objeto? Las condiciones simples tienen que editarse después de añadirlas para establecer sus parámetros.</para> <para>Las condiciones compuestas, en cambio, no tienen parámetros que establecer. Se definen mediante su propio tipo y sus condiciones hijas.</para> <para>Para editar una condición, selecciónala en el <link url="widget:waitForTreeView">árbol de condiciones</link> y luego haz click en el <link url="widget:editButton">botón <interface>Editar...</interface></link>.</para>

# @info
source: <para>The parameters that have to be set depend on the type of the condition. In this case, the name of the object that emits the signal and the name of the signal are needed.</para> <para><application>KTutorial editor</application> is able to <emphasis>talk</emphasis> to the application that the tutorial is being designed for and show you the name of the objects and the signals they emit. However, this will be seen in another tutorial. In this one you will be given all the values you need.</para> <para>Ok, back to the condition. We have asked the user to write <emphasis>Hello world!</emphasis> in the text area, so we want to react when the text in the text area changes.</para> <para>The text area is appropriately named <emphasis>textArea</emphasis>, and it emits the signal <emphasis>textChanged()</emphasis>. Set those values in the <link url="widget:objectNameLineEdit"><interface>emitter name</interface> field</link> and in the <link url="widget:signalNameLineEdit"><interface>signal name</interface> field</link>, respectively, and accept the dialog.</para>
es: <para>Los parámetros a establecer dependen del tipo de la condición. En este caso, se necesitan el nombre del objeto que emite la señal y el nombre de la señal.</para> <para><application>KTutorial editor</application> es capaz de <emphasis>hablar</emphasis> con la aplicación para la que se está diseñando el tutorial y mostrarte el nombre de los objetos y las señales que emiten. Sin embargo, esto se verá en otro tutorial. En éste se te proporcionarán todos los valores que necesitas.</para> <para>Bien, volvamos con la condición. Pedimos al usuario que escribiese <emphasis>¡Hola mundo!</emphasis> en el área de texto, así que queremos reaccionar cuando cambie el texto en el área de texto.</para> <para>El área de texto se llama <emphasis>textArea</emphasis> y emite la señal <emphasis>textChanged()</emphasis>. Establece esos valores en el <link url="widget:objectNameLineEdit">campo <interface>nombre del emisor</interface></link> y en el <link url="widget:signalNameLineEdit">campo <interface>nombre de la señal</interface></link>, respectivamente, y acepta el diálogo.</para>

# @info
source: <para>Now that the parameters of the condition are set, the step will react whenever the user writes something in the text area. But, how should it react?</para> <para>We want to advance to the next step when the user writes <emphasis>Hello world!</emphasis>, but textChanged() is emitted whenever the text was changed no matter what was written. So, before changing to the next step, we must check that the text area contains the expected text.</para> <para>The checks will be made using some custom Javascript code, so select the <link url="widget:responseCodeRadioButton"><interface>custom response code</interface> radio button.</link>.</para>
es: <para>Ahora que ya se establecieron los parámetros de la condición, el paso reaccionará cuando el usuario escriba algo en el área de texto. Pero, ¿cómo debería reaccionar?</para> <para>Queremos avanzar al siguiente paso cuando el usuario escriba <emphasis>¡Hola mundo!</emphasis>, pero textChanged() se emite cada vez que se cambia el texto independientemente de lo escrito. Así que, antes de cambiar al siguiente paso, debemos comprobar que el área de texto contiene el texto esperado.</para> <para>Las comprobaciones se harán utilizando cierto código Javascript propio, así que selecciona el <link url="widget:responseCodeRadioButton">botón <interface>código propio de respuesta</interface></link>.</para>

# @info
source: <para>The following code snippet gets the text area object, checks if it contains the text <emphasis>Hello world!</emphasis> (without taking into account upper and lower cases) and, in that case, changes to the step <emphasis>clearText</emphasis>:</para> <pre>textArea = ktutorial.findObject("textArea"); if (textArea.plainText.toLowerCase() == t.i18n("Hello world!").toLowerCase()) { tutorial.nextStep("clearText"); }</pre> <para>You can copy the code selecting it with the mouse, clicking with the right mouse button on the selection and then clicking on <interface>Copy</interface>. To paste it, click with the right mouse button on the <link url="widget:responseCodeTextEdit">custom response code area</link> and then on <interface>Paste</interface>. Once done, accept the dialog.</para>
es: <para>El siguiente fragmento de código obtiene el objeto del área de texto, comprueba si contiene el texto <emphasis>¡Hola mundo!</emphasis> (sin tener en cuenta mayúsculas y minúsculas) y, en ese caso, cambia al paso <emphasis>limpiarTexto</emphasis>:</para> <pre>textArea = ktutorial.findObject("textArea"); if (textArea.plainText.toLowerCase() == t.i18n("¡Hola mundo!").toLowerCase()) { tutorial.nextStep("limpiarTexto"); }</pre> <para>Puedes copiar el código seleccionándolo con el ratón, haciendo click con el botón derecho del ratón en la selección y después haciendo click en <interface>Copiar</interface>. Para pegarlo, haz click con el botón derecho en el <link url="widget:responseCodeTextEdit">área de código de la respuesta propia</link> y luego en <interface>Pegar</interface>. Cuando esté copiado, acepta el diálogo.</para>

# @info
source: <para>Well, we have just created the start step of the tutorial. It waits for the user to write <emphasis>Hello world!</emphasis> in the text area and then changes to the clearText step.</para> <para>Now we will take care of the clearText step. Let's begin by adding a new step.</para>
es: <para>Bien, acabamos de crear el paso start del tutorial. Espera a que el usuario escriba <emphasis>¡Hola mundo!</emphasis> en el área de texto y entonces cambia al paso limpiarTexto.</para> <para>Ahora nos encargaremos del paso limpiarTexto. Empecemos por añadir un nuevo paso.</para>

# @info
source: <para>Set the id of the step to <emphasis>clearText</emphasis> and the text to <emphasis>Now you have to trigger the clear action. To do this you can click in &lt;interface&gt;File|Clear&lt;/interface&gt;, or in the toolbar button called &lt;interface&gt;Clear&lt;/interface&gt;.</emphasis>, then accept the dialog.</para> <para>Like <emphasis>&lt;emphasis&gt;</emphasis> in the text of the start step, <emphasis>&lt;interface&gt;</emphasis> is another special markup used when referring to something in the graphical user interface.</para>
es: <para>Pon <emphasis>limpiarTexto</emphasis> como identificador del paso y <emphasis>Ahora debes activar la acción de limpiar. Para hacer esto puedes hacer click en &lt;interface&gt;Archivo|Limpiar&lt;/interface&gt; o en el botón de la barra de herramientas llamado &lt;interface&gt;Limpiar&lt;/interface&gt;.</emphasis> como texto, luego acepta el diálogo.</para> <para>Al igual que <emphasis>&lt;emphasis&gt;</emphasis> en el texto del paso start, <emphasis>&lt;interface&gt;</emphasis> es otro marcado especial utilizado para referirse a algo en la interfaz gráfica de usuario.</para>
