Repository: KDE/ktutorial
Catalog: ktutorial-editor/po/*.po
Languages: es

# @item
source: When the property %1 in the object %2 has the value %3
es: Cuando la propiedad %1 del objeto %2 tenga el valor %3

# @item
source: (signal not set)
es: (señal no establecida)

# @item
source: When the signal %1 is emitted by object %2
es: Cuando se emita la señal %1 por el objeto %2

# @item
source: When the step is activated
es: Cuando se active el paso

# @item
source: When the window %1 is shown
es: Cuando se muestre la ventana %1

# @title:menu Noun, a step in a tutorial
source: Step
es: Paso

# @title:menu Noun, a reaction in a step
source: Reaction
es: Reacción

# @title:menu
source: Panels
es: Paneles

# @title:menu
source: Main Toolbar
es: Barra de herramientas principal

# @title
source: Set tutorial license
es: Establecer la licencia del tutorial

# @info:whatsthis
source: <para>Set the license of the tutorial.</para> <para>The license is copied, commented, to the top of the exported tutorial file. That is, you don't have to worry about how comments are written in the programming language the tutorial will be exported to. Just set the pure text of the license, and the editor will take care of adding the necessary characters in each line to mark them as comments instead of source code.</para>
es: <para>Establece la licencia del tutorial.</para> <para>La licencia se copia, comentada, en la parte superior del archivo al que se exporta el tutorial. Es decir, no tienes que preocuparte de cómo se escriben los comentarios en el lenguaje de programación en el que se exportará. Simplemente establece el texto puro de la licencia, y el editor se encargará de añadirle los caracteres necesarios en cada línea para indicar que son comentarios en lugar de código fuente.</para>

# @title
source: License text
es: Texto de la licencia

# @title
source: New condition to wait for
es: Nueva condición por la que esperar

# @info:whatsthis
source: <para>Selects the type of the new condition.</para>
es: <para>Selecciona el tipo de la nueva condición.</para>

# @title
source: Condition to wait for type
es: Tipo de la condición por la que esperar

# @label:listbox
source: Type:
es: Tipo:

# @item:inlistbox
source: All the contained conditions must match
es: Todas las condiciones contenidas deben cumplirse

# @item:inlistbox
source: Any of the contained conditions must match
es: Alguna de las condiciones contenidas debe cumplirse

# @item:inlistbox
source: The contained condition can't match
es: La condición contenida no puede cumplirse

# @item:inlistbox
source: The specified event is received
es: Se recibe el evento especificado

# @item:inlistbox
source: The specified property has certain value
es: La propiedad especificada tiene cierto valor

# @item:inlistbox
source: The step is activated
es: Se activa el paso

# @info:whatsthis
source: <para>Edit the response of a step to certain trigger.</para> <para>When a step is active, the actions of the user can trigger a response in the tutorial. A trigger can be an option in the step selected by the user, or a condition that was met. The response can be changing to another step, or executing some custom code.</para>
es: <para>Editar la respuesta de un paso ante cierto activador.</para> <para>Cuando un paso está activo, las acciones del usuario pueden provocar una respuesta en el tutorial. Un activador puede ser una opción en el paso seleccionada por el usuario, o una condición que se cumplió. La respuesta puede ser cambiar a otro paso, o ejecutar cierto código propio.</para>

# @title:group Something that causes a response
source: Trigger
es: Activador

# @option:radio
source: Option:
es: Opción:

# @info:whatsthis
source: <para>The name of the option.</para> <para>An option with this name will be added to the step, so the same name set here will be shown to the user.</para>
es: <para>El nombre de la opción.</para> <para>Una opción con ese nombre se añadirá al paso, por lo que el mismo nombre establecido aquí será el mostrado al usuario.</para>

# @option:radio
source: Condition met:
es: Condición cumplida:

# @title:group
source: Response
es: Respuesta

# @option:radio
source: Change to step:
es: Cambiar al paso:

# @info:whatsthis
source: <para>The id of the step to change to.</para>
es: <para>El identificador del paso al que cambiar.</para>

# @option:radio
source: Custom response code:
es: Código propio de respuesta:

# @info:whatsthis
source: <para>The custom code to execute.</para> <para>The code will be written as is into a new function called when the response is triggered. This means that the code must be written in the same programming language the tutorial will be exported to.</para> <para>Also note that you only have to provide the body of the function. The signature is automatically generated.</para>
es: <para>El código propio a ejecutar.</para> <para>El código se escribirá tal cuál en una nueva función que se ejecutará cuando se cause la respuesta. Esto quiere decir que el código debe estar escrito en el mismo lenguaje de programación que en el que se exportará el tutorial.</para> <para>Además, ten en cuenta que sólo tienes que especificar el cuerpo de la función. La signatura se genera automáticamente.</para>

# @title:window
source: Target application objects
es: Objetos de la aplicación objetivo

# @info:whatsthis
source: <p>Chooser for objects in the target application.</p> <p>The objects shown in the list are all the objects accessible through KTutorial. They are shown in a tree structure to represent the parent and child relationships the objects have.</p> <p>Note, however, that not all the objects have a name set in the target application. KTutorial needs to know the name of the object to find it, so if an object does not have a name KTutorial will not be able to use it.</p>
es: <p>Selector para objetos de la aplicación objetivo.</p> <p>Los objetos mostrados en la lista son todos los objetos a lo que puede accederse mediante KTutorial. Se muestran en una estructura de árbol para reflejar las relaciones de parentesco que tienen esos objetos.</p> <p>Ten en cuenta, no obstante, que no todos los objetos tienen un nombre establecido en la aplicación objetivo. KTutorial necesita saber el nombre del objeto para encontrarlo, por lo que si un objeto no tiene nombre KTutorial no podrá utilizarlo.</p>

# @info:whatsthis
source: <p>Filters the objects shown in the list.</p> <p>Note, however, that if an object has to be shown in the list its parent object is also shown even if it should have been filtered.</p>
es: <p>Filtra los objetos mostrados en la lista.</p> <p>Ten en cuenta, no obstante, que si se muestra un objeto en la lista también se mostrará su objeto padre, incluso si éste debería estar filtrado.</p>

# @title:group
source: Filters
es: Filtros

# @option:check
source: Show only named objects
es: Mostrar sólo objetos con nombre

# @option:check
source: Show only widgets
es: Mostrar sólo widgets

# @title
source: Choose the remote object name
es: Escoger el nombre del objeto remoto

# @info:whatsthis
source: <para>Choose the name of the remote object.</para> <para>If the name is known, it can be directly written. Else, it can be chosen from all the objects currently available in the target application.</para>
es: <para>Escoger el nombre del objeto remoto.</para> <para>Si se sabe el nombre se puede escribir directamente. Sino, puede escogerse de entre todos los objetos disponibles actualmente en la aplicación objetivo.</para>

# @info:whatsthis
source: <para>The name of the QObject.</para> <para>Note that the name is not the class of the object, but the string returned by its objectName() method.</para>
es: <para>El nombre del QObject.</para> <para>Ten en cuenta que el nombre no es la clase del objeto, sino la cadena devuelta por su método objectName().</para>

# @info:tooltip
source: Choose the object name from a list with all the objects in the target application
es: Escoger el nombre del objeto desde una lista con todos los objetos de la aplicación objetivo

# @info:whatsthis
source: <p>Opens the list with all the objects in the target application to select the object from them.</p> <p>The object list must be gotten from a running application. The first time that you try to choose the object name you will be asked for the target application of the tutorial. A new instance of the application will then be started to know the available objects.</p> <p>The next time that you try to choose the object name the already running application will be used. If it is quitted, a new instance will be started again.</p> <p>When the target application is started all the KTutorial editor windows, except the one with the list, will be hidden. When the list is closed, the windows will be shown again.</p>
es: <p>Abre la lista con todos los objetos de la aplicación objetivo para seleccionar el objeto de entre ellos.</p> <p>La lista de objetos debe obtenerse de una aplicación en funcionamiento. La primera vez que intentes escoger el nombre del objeto se te preguntará por la aplicación objetivo del tutorial. Entonces una nueva instancia de la aplicación se arrancará para saber qué objetos están disponibles.</p> <p>La siguiente vez que intentes escoger el nombre del objeto se utilizará la aplicación que ya está en funcionamiento. Si se sale de ella, una nueva instancia se arrancará de nuevo.</p> <p>Cuando la aplicación objetivo arranque todas las ventanas de KTutorial editor, salvo la que tiene la lista, se ocultarán. Cuando se cierre la lista, las ventanas volverán a mostrarse de nuevo.</p>

# @action:button
source: Choose...
es: Escoger...

# @title
source: URL for <emphasis>link</emphasis> element
es: URL para el elemento <emphasis>link</emphasis>

# @info:whatsthis
source: <para>Set the <emphasis>url</emphasis> attribute for the <emphasis>link</emphasis> semantic element.</para> <para>Any URL can be set in the <interface>Generic</interface> field. For example, the URL of a webpage or the URL to link to a widget.</para> <para>However, to link to a widget it is better to just write the object name of the desired widget in the <interface>Widget</interface> field. Moreover, that field provides also text completion for the names and a dialog to choose the widget from a running target application.</para> <para>These advanced features, though, are not available in every system; if <application>KTutorial editor</application> was not built with <application>QtDBus</application> support only a plain text line will be shown. Again, only the name has to be written in the text line for the widget; <emphasis>widget:</emphasis> is automatically added to the URL when the dialog is accepted.</para>
es: <para>Establecer el atributo <emphasis>url</emphasis> del elemento semántico <emphasis>link</emphasis>.</para> <para>Se puede establecer cualquier URL en el campo <interface>Genérica</interface>. Por ejemplo, la URL de una página web o la URL para enlazar a un widget.</para> <para>Sin embargo, para enlazar a un widget es mejor escribir en el campo <interface>Widget</interface> simplemente el nombre de objeto del widget al que se quiere enlazar. Además, dicho campo proporciona completado de texto para los nombres y un diálogo para escoger el widget desde una aplicación objetivo en funcionamiento.</para> <para>Estas características avanzadas, no obstante, no están disponibles en todos los sistemas; si <application>KTutorial editor</application> no se construyó con soporte para <application>QtDBus</application> sólo se mostrará una simple línea de texto. En este caso sigue siendo suficiente con escribir únicamente el nombre en la línea de texto para el widget; <emphasis>widget:</emphasis> se añade automáticamente a la URL cuando se acepta el diálogo.</para>

# @option:radio Generic link URL
source: Generic
es: Genérica

# @title
source: Set step data
es: Establecer datos del paso

# @info:whatsthis
source: <para>Set the id and the text of the step</para> <para>The text is shown to the user when the tutorial changes to that step.</para> <para>On the other hand, the id is only used internally and never shown to the user. It is used to identify the steps in the tutorial when it has to change from one to step to another.</para>
es: <para>Establecer el identificador y el texto del paso</para> <para>El texto se muestra al usuario cuando el tutorial cambia a ese paso.</para> <para>En cambio, el identificador sólo se utiliza internamente y nunca se muestra al usuario. Se utiliza para identificar los pasos en el tutorial cuando tiene que cambiar de un paso a otro.</para>

# @title
source: Step data
es: Datos del paso

# @label:textbox
source: Id:
es: Identificador:

# @label:textbox
source: Text:
es: Texto:

# @title
source: Set tutorial information
es: Establecer la información del tutorial

# @info:whatsthis
source: <para>Set the name and description of the tutorial.</para> <para>The name and the description are shown in the dialog where the tutorial to be started is selected.</para>
es: <para>Establecer el nombre y la descripción del tutorial.</para> <para>El nombre y la descripción se muestran en el diálogo en el que se selecciona qué tutorial se empezará.</para>

# @title
source: Tutorial information
es: Información del tutorial

# @label:textbox Noun, the name of a tutorial
source: Name:
es: Nombre:

# @label:textbox
source: Description:
es: Descripción:

# @title
source: Edit event to wait for
es: Editar el evento por el que esperar

# @info:whatsthis
source: <para>Set the receiver name and the event to wait for.</para>
es: <para>Establece el nombre del receptor y el evento por el que esperar.</para>

# @title:group
source: Wait for event
es: Esperar por el evento

# @label:textbox
source: Receiver name:
es: Nombre del receptor:

# @label:textbox
source: Event name:
es: Nombre del evento:

# @info:whatsthis
source: <para>The name of the QObject that receives the event.</para> <para>Note that the name is not the class of the object, but the string returned by its objectName() method.</para>
es: <para>El nombre del QObject que recibe el evento.</para> <para>Ten en cuenta que el nombre no es la clase del objeto, sino la cadena devuelta por su método objectName().</para>

# @info:whatsthis
source: <para>The name of the event.</para> <para>The name must not contain the "QEvent::" prefix, only the pure name of the event.</para>
es: <para>El nombre del evento.</para> <para>El nombre no debe contener el prefijo "QEvent::", sólo el nombre puro del evento.</para>

# @title
source: Edit property to wait for
es: Editar la propiedad por la que esperar

# @info:whatsthis
source: <para>Set the object name, the property name and the value to wait for.</para>
es: <para>Establece el nombre del objeto, el nombre de la propiedad y el valor por el que esperar.</para>

# @title:group
source: Wait for property
es: Esperar por la propiedad

# @label:textbox
source: Object name:
es: Nombre del objeto:

# @label:textbox
source: Property name:
es: Nombre de la propiedad:

# @label:textbox
source: Value:
es: Valor:

# @info:whatsthis
source: <para>The name of the QObject that contains the property.</para> <para>Note that the name is not the class of the object, but the string returned by its objectName() method.</para>
es: <para>El nombre del QObject que contiene la propiedad.</para> <para>Ten en cuenta que el nombre no es la clase del objeto, sino la cadena devuelta por su método objectName().</para>

# @info:whatsthis
source: <para>The name of the property.</para> <para>Not every property can be used to wait until its value changes to the expected one. Only properties that have a notify signal can be used with that purpose.</para> <para>Properties that do not have a notify signal can still be used to enrich other conditions (for example, waiting for a signal to be emitted but only changing to the next step if, in addition, some property has some value), but they can not be used alone as single conditions in a reaction.</para>
es: <para>El nombre de la propiedad.</para> <para>No todas las propiedades se pueden usar para esperar hasta que su valor cambie al esperado. Sólo se pueden utilizar para dicho propósito las propiedades que tienen una señal de notificación.</para> <para>Aún con todo, las propiedades que no tienen una señal de notificación pueden usarse para enriquecer otras condiciones (por ejemplo, esperar a que se emita una señal pero cambiar al siguiente paso sólo si, además, cierta propiedad tiene cierto valor), pero no pueden utilizarse en solitario como las únicas condiciones de una reacción.</para>

# @info:whatsthis
source: <para>The expected value of the property.</para> <para>The value is copied as is to the script. That means that it has to be written with the syntax of the script language that the tutorial is going to be exported to. For example, if the tutorial is going to be exported to Javascript and the value to wait for is a text, the value has to be written as <em>"The expected text"</em> (wrapped in quotes).</para> <para>The value can even contain a programming expression in the script language. For example, something like <em>t.i18nc("@item:inlistbox", "Certain item text")</em> would be used to wait for the localized text of an item in a combo box.</para>
es: <para>El valor esperado de la propiedad.</para> <para>El valor se copia tal cuál en el script. Esto quiere decir que tiene que escribirse con la sintaxis del lenguaje de script al que se va a exportar el tutorial. Por ejemplo, si el tutorial se va a exportar en Javascript y el valor por el que esperar es un texto, el valor tiene que escribirse así: <em>"El texto esperado"</em> (es decir, entrecomillado).</para> <para>El valor puede contener incluso una expresión de programación en el lenguaje de script. Por ejemplo, algo similar a <em>t.i18nc("@item:inlistbox", "Certain item text")</em> se utilizaría para esperar por el texto localizado de un elemento en una lista desplegable.</para>

# @title
source: Edit signal to wait for
es: Editar la señal por la que esperar

# @info:whatsthis
source: <para>Set the emitter name and the signal to wait for.</para>
es: <para>Establece el nombre del emisor y la señal por la que esperar.</para>

# @title:group
source: Wait for signal
es: Esperar por la señal

# @label:textbox
source: Emitter name:
es: Nombre del emisor:

# @label:textbox
source: Signal name:
es: Nombre de la señal:

# @info:whatsthis
source: <para>The name of the QObject that emits the signal.</para> <para>Note that the name is not the class of the object, but the string returned by its objectName() method.</para>
es: <para>El nombre del QObject que emite la señal.</para> <para>Ten en cuenta que el nombre no es la clase del objeto, sino la cadena devuelta por su método objectName().</para>

# @info:whatsthis
source: <para>The name of the signal.</para> <para>The name must be written as <em>signalName(TypeOfFirstArgument, TypeOfSecondArgument, TypeOfThirdArgument...)</em>, without including <em>SIGNAL()</em> wrapping text.</para>
es: <para>El nombre de la señal.</para> <para>El nombre debe estar escrito como <em>nombreDeLaSeñal(TipoDelPrimerArgumento, TipoDelSegundoArgumento, TipoDelTercerArgumento...)</em>, sin estar envuelto en el texto <em>SIGNAL()</em>.</para>

# @title
source: Edit condition to wait for
es: Editar la condición por la que esperar

# @info:whatsthis
source: <para>Edit a condition to wait for until it is met.</para> <para>A condition can be a plain condition or a composed condition. Plain conditions wait for some specific thing to happen, for example, they wait until a signal is emitted. Composed conditions contain other conditions (plain or also composed) and wait until something happens in its contained conditions, for example, wait until all the contained conditions were met.</para>
es: <para>Editar la condición por la que esperar hasta que se cumpla.</para> <para>Una condición puede ser una condición simple o una condición compuesta. Las condiciones simples esperan hasta que algo concreto ocurra, por ejemplo, esperan hasta que se emita una señal. Las condiciones compuestas contienen otras condiciones (simples o también compuestas) y esperan hasta que algo ocurra en las condiciones que contienen, por ejemplo, esperan hasta que todas las condiciones que contienen se hayan cumplido.</para>

# @info:tooltip
source: Add a new condition
es: Añadir una nueva condición

# @info:whatsthis
source: <para>Adds a new condition.</para> <para>A condition has to be added to composed conditions, that is, conditions that contain other conditions, or as the root condition when there is no other condition.</para>
es: <para>Añade una nueva condición.</para> <para>Una condición tiene que añadirse a condiciones compuestas, es decir, condiciones que contienen otras condiciones, o como la condición base cuando no hay más condiciones.</para>

# @action:button
source: Add...
es: Añadir...

# @info:tooltip
source: Edit the selected condition
es: Editar la condición seleccionada

# @info:whatsthis
source: <para>Edits the selected condition.</para> <para>Only plain conditions, that is, conditions that aren't composed by other conditions, can be edited.</para>
es: <para>Edita la condición seleccionada.</para> <para>Sólo las condiciones simples, es decir, las condiciones que no están compuestas por otras condiciones, pueden editarse.</para>

# @action:button
source: Edit...
es: Editar...

# @info:tooltip
source: Remove the selected condition
es: Eliminar la condición seleccionada

# @info:whatsthis
source: Removes the selected condition.
es: Elimina la condición seleccionada.

# @action:button
source: Remove
es: Eliminar

# @title
source: Edit window to wait for
es: Editar la ventana por la que esperar

# @info:whatsthis
source: <para>Set the object name of the window to wait for.</para>
es: <para>Establece el nombre del objeto de la ventana por la que esperar.</para>

# @title:group
source: Wait for window
es: Esperar por la ventana

# @label:textbox
source: Window name:
es: Nombre de la ventana:

# @info:whatsthis
source: <para>The name of the window to be shown.</para> <para>Note that the name is not the title of the window or its class name, but the string returned by its objectName() method.</para> <para>Also note that it can wait either for windows or for dialogs, not just for windows.</para>
es: <para>El nombre de la ventana a mostrar.</para> <para>Ten en cuenta que el nombre no es el título de la ventana ni la clase del objeto, sino la cadena devuelta por su método objectName().</para> <para>Además ten en cuenta que puede esperar tanto por ventanas como por diálogos, no solo por ventanas.</para>

# NAME OF TRANSLATORS
source: Your names
es: Daniel Calviño Sánchez

# EMAIL OF TRANSLATORS
source: Your emails
es: danxuliu@gmail.com
