Repository: KDE/ktutorial
Catalog: ktutorial-editor/po/*.po
Languages: es

# @info
source: <para>We are again in a point where we need to know the name of an object, in this case, the name of the <interface>Ok</interface> button. This time, though, we will not choose it from the list. We will see another little <application>KTutorial editor</application> feature instead.</para> <para>When there is a target application running (if you closed it, start it again clicking on <interface>Choose...</interface> and then closing the list), the field to set an object name offers text completion with the names of the objects in the target application. Like the list to select an object, the completion list is dynamic, so entries are added and removed based on objects added and removed in the target application.</para> <para>Ensure that the target application is running and that, in that target application, the dialog to add a new step is open. Then just write <emphasis>o</emphasis> in the <link url="widget:objectNameLineEdit">emitter name field</link> and watch the completion list pop up.</para>
es: <para>De nuevo llegamos a un punto en el que necesitamos saber el nombre de un objeto, en este caso, el nombre del botón <interface>Aceptar</interface>. Esta vez, no obstante, no lo escogeremos de la lista. En su lugar veremos otra pequeña característica de <application>KTutorial editor</application>.</para> <para>Cuando hay una aplicación objetivo en funcionamiento (si la cerraste, arráncala de nuevo haciendo click en <interface>Escoger...</interface> y luego cerrando la lista), el campo para establecer el nombre de un objeto ofrece completado de texto con los nombres de los objetos de la aplicación objetivo. Como la lista para seleccionar un objeto, la lista de completado es dinámica, por lo que las entradas se añaden y eliminan en base a los objetos añadidos y eliminados en la aplicación objetivo.</para> <para>Asegúrate de que la aplicación objetivo está en funcionamiento y que, en dicha aplicación objetivo, el diálogo para añadir un nuevo paso está abierto. Luego escribe simplemente <emphasis>o</emphasis> en el <link url="widget:objectNameLineEdit">campo del nombre del emisor</link> y ve cómo aparece la lista de completado.</para>

# @info
source: <para>As you can see, the completion list proposes <emphasis>okButton</emphasis>, as it is the only object in the target application whose name starts with <emphasis>o</impact>. The completion list proposes all the objects in the target application whose name starts with the text written in the emitter name field.</para> <para>You should set the emitter name to <emphasis>okButton</emphasis>, but instead of writing it use the completion list. To use some proposed completion click on it with the mouse, or traverse the list using the up and down keys pressing enter when you reach the desired one.</para>
es: <para>Como puedes ver, la lista de completado propone <emphasis>okButton</emphasis>, ya que es el único objeto de la aplicación objetivo cuyo nombre empieza por <emphasis>o</impact>. La lista de completado propone todos los objetos de la aplicación objetivo cuyo nombre comienza con el texto escrito en el campo del nombre del emisor.</para> <para>Deberías poner <emphasis>okButton</emphasis> como nombre del emisor, pero en lugar de escribirlo utiliza la lista de completado. Para utilizar cierta propuesta de completado haz click sobre ella con el ratón, o recorre la lista utilizando las teclas de arriba y abajo pulsando intro cuando llegues a la deseada.</para>

# @info
source: <para>The signal name field also provides completion when the target application is running and the emitter name was set.</para> <para>Note that the completion list can also be triggered using the standard shortcut <shortcut>Ctrl+T</shortcut> when the focus is on a text edition widget. Click on the <link url="widget:signalNameLineEdit">signal name field</link> to give it the focus, then press <shortcut>Ctrl+T</shortcut> to show all the signals that can be emitted by the <interface>Ok</interface> button.</para>
es: <para>El campo del nombre de la señal también tiene completado cuando la aplicación objetivo está en funcionamiento y se estableció el nombre del emisor.</para> <para>Ten en cuenta que la lista de completado también se puede activar utilizando el atajo de teclado por defecto <shortcut>Ctrl+T</shortcut> cuando el foco está en un widget de edición de texto. Haz click en el <link url="widget:signalNameLineEdit">campo del nombre de la señal</link> para darle el foco, luego presiona <shortcut>Ctrl+T</shortcut> para mostrar todas las señales que puede emitir el botón <interface>Aceptar</interface>.</para>

# @info
source: <para>As it was explained before, we want to react when the <interface>Ok</interface> button is clicked, so select the <emphasis>clicked()</emphasis> signal from the completion list.</para>
es: <para>Como se explicó anteriormente, queremos reaccionar cuando se haga click en el botón <interface>Aceptar</interface>, así que selecciona la señal <emphasis>clicked()</emphasis> de la lista de completado.</para>

# @info
source: <para>Now that the emitter and signal names were set <link url="widget:editWaitForSignalDialog/okButton">accept the dialog</link>.</para>
es: <para>Ahora que se establecieron los nombres del emisor y la señal <link url="widget:editWaitForSignalDialog/okButton">acepta el diálogo</link>.</para>

# @info
source: <para>The user accepting the dialog to add a new step will make our example tutorial to change to its last step.</para> <para>Set the <link url="widget:responseStepLineEdit">step to change to</link> to <emphasis>end</emphasis>.</para>
es: <para>Que el usuario acepte el diálogo para añadir un nuevo paso hará que nuestro tutorial de ejemplo cambie a su último paso.</para> <para>Pon <emphasis>end</emphasis> como el <link url="widget:responseStepLineEdit">paso al que cambiar</link>.</para>

# @info
source: <para>The last step in the tutorial will just inform the user that the tutorial is done.</para> <para>As with the previous ones, we have to start by <link url="widget:addStepToolButton">adding a new step</link>.</para>
es: <para>El último paso del tutorial simplemente informará al usuario de que se terminó el tutorial.</para> <para>Como con los anteriores, tenemos que empezar por <link url="widget:addStepToolButton">añadir un nuevo paso</link>.</para>

# @info
source: <para>Set the <link url="widget:idLineEdit">id of the step</link> to <emphasis>end</emphasis>.</para>
es: <para>Pon <emphasis>end</emphasis> como <link url="widget:idLineEdit">identificador del paso</link>.</para>

# @info
source: <para>Set the <link url="widget:textTextEdit">text of the step</link> to:</para> <para><emphasis>And that's all!</emphasis></para>
es: <para>Pon como <link url="widget:textTextEdit">texto del paso</link>:</para> <para><emphasis>¡Y eso es todo!</emphasis></para>

source: And that's all!
es: ¡Y eso es todo!

# @info
source: <para>Well, now that we have added that last step the example tutorial is done. But, when designing a tutorial, how can we know that it does what we expect it to do?</para> <para><application>KTutorial editor</application> is able to start the tutorial being designed in its target application without having to manually export and install the tutorial. This way you can truly check that the tutorial will behave as you expect.</para> <para>When testing a tutorial you are advised to use a target application in a clean state, like you would do when using a tutorial from that application.</para> <para>So cancel the dialog to add a new step in the target application if you haven't done it yet. Then, to start in the target application the tutorial we have been editing click on <interface>Edit|Test tutorial</interface>, or the <interface>Test tutorial</interface> button in the toolbar.</para>
es: <para>Bien, ahora que añadimos ese último paso ya terminamos nuestro tutorial de ejemplo. Pero, cuando se diseña un tutorial, ¿cómo podemos saber que hace lo que esperamos que haga?</para> <para><application>KTutorial editor</application> es capaz de empezar el tutorial que se está diseñando en su aplicación objetivo sin tener que exportar e instalar el tutorial manualmente. De este modo puedes comprobar realmente que el tutorial se comporta como esperas.</para> <para>Cuando se prueba un tutorial es mejor que utilices una aplicación objetivo en un estado limpio, como harías si usases un tutorial en esa aplicación.</para> <para>Así pues, cancela el diálogo para añadir un nuevo paso en la aplicación objetivo si no lo hiciste aún. Luego, para empezar en la aplicación objetivo el tutorial que hemos estado editando haz click en <interface>Editar|Probar tutorial</interface>, o en el botón <interface>Probar tutorial</interface> de la barra de herramientas.</para>

# @info
source: <para>The tutorial shown in the target application is the one we have been designing. If you add a new step, it will change to the second step, and if you accept the dialog it will change to the last step.</para> <para>Note, however, that when a tutorial is tested it is not installed. The tutorials must be installed to be available in the tutorial list of the target application.</para> <para>And that's all, the tutorial about the interaction with the target application ends here.</para>
es: <para>El tutorial mostrado en la aplicación objetivo es el que hemos estado diseñando. Si añades un nuevo paso, cambiará al segundo paso, y si aceptas el diálogo cambiará al último paso.</para> <para>Ten en cuenta, no obstante, que cuando se prueba un tutorial no se instala. Los tutoriales deben instalarse para estar disponibles en la lista de tutoriales de la aplicación objetivo.</para> <para>Y eso es todo, aquí termina el tutorial sobre la interacción con la aplicación objetivo.</para>

# @label
source: There was a problem when trying to save the tutorial to a temporary file (to be used by the target application to test the tutorial):<nl/>%1
es: Ocurrió un problema cuando se intentaba guardar el tutorial a un archivo temporal (para usarse en la aplicación objetivo para probar el tutorial):<nl/>%1

# @label
source: There was a problem when trying to tell the target application to start the tutorial:<nl/>%1
es: Ocurrió un problema cuando se intentaba decir a la aplicación objetivo que empezase el tutorial:<nl/>%1

# @title:window
source: Tutorial could not be started
es: No se pudo empezar el tutorial

# @item
source: Reaction
es: Reacción

# @item
source: (No condition set)
es: (Condición no establecida)

# @item
source: (option name not set)
es: (nombre de la opción no establecido)

# @item
source: When the option %1 is selected
es: Cuando se seleccione la opción %1

# @item
source: Execute the following code:
es: Ejecutar el siguiente código:

# @item
source: (No code set)
es: (Código no establecido)

# @item
source: (step id not set)
es: (identificador del paso no establecido)

# @item
source: Change to step %1
es: Cambiar al paso %1

# @label
source: The target application has been closed, but it must be running to be able to choose the objects.
es: La aplicación objetivo ha sido cerrada, pero debe estar en funcionamiento para poder escoger los objetos.

# @title:window
source: Target application closed
es: Aplicación objetivo cerrada

# @label
source: <para>The <application>KTutorial editor</application> windows will be hidden and only the list with the objects in the target application will be shown. It is made to better view when a widget is highlighted in the target application.</para><para>The <application>KTutorial editor</application> windows will be shown again once the selection list is closed.</para>
es: <para>Se ocultarán las ventanas de la aplicación <application>KTutorial editor</application> y únicamente se mostrará la lista con los objetos de la aplicación objetivo. Esto se hace para poder ver mejor cuando se remarca un widget en la aplicación objetivo.</para><para>Las ventanas de <application>KTutorial editor</application> se mostrarán de nuevo cuando se cierre la lista de selección.</para>

# @title:window
source: <application>KTutorial editor</application> windows will be hidden
es: Se ocultarán las ventanas de <application>KTutorial editor</application>

# @label
source: The object name can not be set, there was a problem getting the name from the target application: %1
es: No se puede establecer el nombre del objeto, hubo un problema obteniendo el nombre desde la aplicación objetivo: %1

# @title
source: Can't communicate with the target application
es: No se puede comunicar con la aplicación objetivo

# @label
source: There is no unique name for the chosen object (at least, in the current state of the target application), so it is not possible to refer to that object in a tutorial. The target application must be modified to provide a unique name for that object.
es: No existe un nombre único para el objeto escogido (al menos, en el estado actual de la aplicación objetivo), por lo que no es posible referirse a dicho objeto desde un tutorial. La aplicación objetivo debe modificarse para asignarle un nombre único a dicho objeto.

# @title
source: The chosen object has no unique name
es: El objeto escogido no tiene un nombre único

# @item
source: D-Bus Error!
es: ¡Error de D-Bus!

# @item
source: Object without name!
es: ¡Objeto sin nombre!

# @item
source: No class name!
es: ¡Sin nombre de clase!

# @info:tooltip
source: Emphasized text
es: Texto enfatizado

# @info:whatsthis
source: Phrase tag to emphasize a word or phrase in the text.<nl/>Example: <emphasis>emphasized text</emphasis>
es: Etiqueta de frase para enfatizar una palabra o frase en el texto.<nl/>Ejemplo: <emphasis>texto enfatizado</emphasis>

# @info:tooltip
source: Strongly emphasized text
es: Texto fuertemente enfatizado

# @info:whatsthis
source: Phrase tag to strongly emphasize a word or phrase in the text.<nl/>Example: <emphasis strong="1">strongly emphasized text</emphasis>
es: Etiqueta de frase para enfatizar fuertemente una palabra o frase en el texto.<nl/>Ejemplo: <emphasis strong="1">texto fuertemente enfatizado</emphasis>

# @info:tooltip
source: Filename or path
es: Nombre de archivo o ruta

# @info:whatsthis
source: Phrase tag for file or folder name or path.<nl/>The path separators will be transformed into what is native to the platform.<nl/>Example: <filename>/home/user/Music/song.ogg</filename>
es: Etiqueta de frase para rutas o nombres de archivos o de carpetas.<nl/>Los separadores de ruta se transformarán en los que sean nativos de la plataforma.<nl/>Ejemplo: <filename>/home/usuario/Música/canción.ogg</filename>

# @info:tooltip
source: GUI interface element
es: Elemento de la interfaz gráfica de usuario

# @info:whatsthis
source: Phrase tag for paths to GUI interface elements.<nl/>If there is more than one element in the path, use "|" to delimit elements, which will be converted into canonical delimiter.<nl/>Example: <interface>File|Open</interface>
es: Etiqueta de frase para rutas a elementos de la interfaz gráfica de usuario.<nl/>Si hay más de un elemento en la ruta, utiliza "|" para delimitar los elementos, y éste será convertido al delimitador canónico.<nl/>Ejemplo: <interface>Archivo|Abrir</interface>

# @info:tooltip
source: Link to URL or widget
es: Enlace a una URL o a un widget

# @info:whatsthis
source: Phrase tag to link to a URL-addressable resource.<nl/>Widgets in the target application interface can be linked using <emphasis>widget:theObjectNameOfTheWidget</emphasis><nl/>Example: <link url="http://www.kde.org">a link</link>
es: Etiqueta de frase para enlaces a recursos direccionables mediante una URL.<nl/>Se puede enlazar a widgets de la interfaz de la aplicación objetivo mediante <emphasis>widget:elNombreDeObjetoDelWidget</emphasis><nl/>Ejemplo: <link url="http://www.kde.org">un enlace</link>

# @info:tooltip
source: Line break
es: Salto de línea

# @info:whatsthis
source: Phrase tag for line breaks.<nl/>Example: line<nl/>break
es: Etiqueta de frase para saltos de línea.<nl/>Ejemplo: salto de<nl/>línea

# @info:tooltip
source: Combination of keys to press
es: Combinación de teclas a pulsar

# @info:whatsthis
source: Phrase tag for combinations of keys to press.<nl/>Separate the keys by "+" or "-", and the shortcut will be converted into canonical form.<nl/>Example: <shortcut>Ctrl+N</shortcut>
es: Etiqueta de frase para combinaciones de teclas a pulsar.<nl/>Separa las teclas mediante "+" o "-", y el atajo de teclado se convertirá a la forma canónica.<nl/>Ejemplo: <shortcut>Ctrl+N</shortcut>

# @info:tooltip
source: Paragraph
es: Párrafo

# @info:whatsthis
source: <para>Structure tag for text paragraphs.<nl/>Example: one paragraph</para><para>Other paragraph</para>
es: <para>Etiqueta de estructura para párrafos de texto.<nl/>Ejemplo: un párrafo</para><para>Otro párrafo</para>

# @info:tooltip
source: List of items
es: Lista de elementos

# @info:whatsthis
source: <para>Structure tag for lists of items.<nl/>Can contain only &lt;item&gt; as subtags. List is considered an element of the paragraph, so the &lt;list&gt; must be found inside &lt;para&gt;.<nl/>Example: <list> <item>One item</item> <item>Other item</item> </list></para>
es: <para>Etiqueta de estructura para listas de elementos.<nl/>La única etiqueta hija que puede contener es &lt;item&gt;. Las listas se consideran elementos de un párrafo, por lo que &lt;list&gt; debe aparecer dentro de &lt;para&gt;.<nl/>Ejemplo: <list> <item>Un elemento</item> <item>Otro elemento</item> </list></para>

# @info:tooltip
source: List items
es: Elementos de una lista

# @info:whatsthis
source: <para>Structure tag for list items.<nl/>Example: <list> <item>One item</item> <item>Other item</item> </list></para>
es: <para>Etiqueta de estructura para elementos de una lista.<nl/>Ejemplo: <list> <item>Un elemento</item> <item>Otro elemento</item> </list></para>

# @title
source: Step setup code
es: Código de inicialización del paso

# @title
source: Set the step setup code
es: Establecer el código de inicialización del paso

# @info:whatsthis
source: <para>Set the code to be executed when the tutorials passes to the step.</para><para>The code will be written as is to the setup of the step, after the setup code generated automatically by the editor. This means that the code must be written in the same programming language the tutorial will be exported to.</para>
es: <para>Establece el código que se ejecutará cuando el tutorial cambie al paso.</para><para>El código se escribirá tal cuál en la inicialización del paso, tras el código de inicialización generado automáticamente por el editor. Esto quiere decir que el código debe estar escrito en el mismo lenguaje de programación que en el que se exportará el tutorial.</para>

# @title
source: Step tear down code
es: Código de finalización del paso

# @title
source: Set the step tear down code
es: Establecer el código de finalización del paso

# @info:whatsthis
source: <para>Set the code to be executed when the tutorial changes from this step to another.</para><para>The code will be written as is to the tear down of the step, before the tear down code generated automatically by the editor. This means that the code must be written in the same programming language the tutorial will be exported to.</para>
es: <para>Establece el código que se ejecutará cuando el tutorial cambie de este paso a otro.</para><para>El código se escribirá tal cuál en la finalización del paso, tras el código de finalización generado automáticamente por el editor. Esto quiere decir que el código debe estar escrito en el mismo lenguaje de programación que en el que se exportará el tutorial.</para>

# @item
source: (id not set)
es: (identificador no establecido)

# @item Noun, a step in a tutorial
source: Step %1
es: Paso %1

# @item
source: (text not set)
es: (texto no establecido)

# @item
source: Text: %1
es: Texto: %1

# @item
source: Setup:
es: Inicialización:

# @item
source: Tear down:
es: Finalización:

# @title:window
source: Problem starting the target application
es: Problema arrancando la aplicación objetivo

# @label
source: The selected application could not be executed. Check the executable file permissions.
es: No se pudo ejecutar la aplicación seleccionada. Comprueba los permisos del archivo ejecutable.

# @label
source: The selected application does not seem to have the KTutorial editor support module enabled. This can happen because the application does not use KTutorial, or because it took it too much time to start.
es: La aplicación seleccionada no parece tener activo el módulo de soporte para KTutorial editor. Esto puede ocurrir porque la aplicación no utiliza KTutorial, o porque le llevó demasiado tiempo arrancar.

# @label
source: Cannot connect to the D-Bus session bus.There is no way to communicate with the target application.
es: No se puede conectar con el bus de sesión de D-Bus. No hay forma de comunicarse con la aplicación objetivo.

# @title
source: Tutorial setup code
es: Código de inicialización del tutorial

# @title
source: Set the tutorial setup code
es: Establecer el código de inicialización del tutorial

# @info:whatsthis
source: <para>Set the code to be executed when the tutorial starts.</para><para>The code will be written as is to the setup of the tutorial, after the setup code generated automatically by the editor. This means that the code must be written in the same programming language the tutorial will be exported to.</para>
es: <para>Establece el código que se ejecutará cuando el tutorial comience.</para><para>El código se escribirá tal cuál en la inicialización del tutorial, tras el código de inicialización generado automáticamente por el editor. Esto quiere decir que el código debe estar escrito en el mismo lenguaje de programación que en el que se exportará el tutorial.</para>

# @title
source: Tutorial tear down code
es: Código de finalización del tutorial

# @title
source: Set the tutorial tear down code
es: Establecer el código de finalización del tutorial...

# @info:whatsthis
source: <para>Set the code to be executed when the tutorial finishes.</para><para>The code will be written as is to the tear down of the tutorial, before the tear down code generated automatically by the editor. This means that the code must be written in the same programming language the tutorial will be exported to.</para>
es: <para>Establece el código que se ejecutará cuando el tutorial termine.</para><para>El código se escribirá tal cuál en la finalización del tutorial, tras el código de finalización generado automáticamente por el editor. Esto quiere decir que el código debe estar escrito en el mismo lenguaje de programación que en el que se exportará el tutorial.</para>

# @item
source: (name not set)
es: (nombre no establecido)

# @item Noun, the name of a tutorial
source: Name: %1
es: Nombre: %1

# @item
source: (description not set)
es: (descripción no establecida)

# @item
source: Description: %1
es: Descripción: %1

# @item
source: License:
es: Licencia:

# @item
source: When all the contained conditions match
es: Cuando todas las condiciones contenidas se cumplan

# @item
source: When any of the contained conditions match
es: Cuando alguna de las condiciones contenidas se cumpla

# @item
source: (object not set)
es: (objeto no establecido)

# @item
source: (event not set)
es: (evento no establecido)

# @item
source: When the event %1 is received by object %2
es: Cuando se reciba el evento %1 en el objeto %2

# @item
source: The contained condition can't have been met
es: La condición contenida no se puede haber cumplido

# @item
source: (object name not set)
es: (nombre de objeto no establecido)

# @item
source: (property not set)
es: (propiedad no establecida)

# @item
source: (value not set)
es: (valor no establecido)
