Repository: KDE/ktutorial
Catalog: ktutorial-editor/po/*.po
Languages: es

# @info
source: <para>The clearText step will wait for the user to trigger the clear action (that is, clicking <interface>Clear</interface> button in the tool bar or <interface>File|Clear</interface> in the menu).</para> <para>So we have to add a reaction to the clearText step. Like we did with the start step, select the clearText step in the tutorial tree view and click on <interface>Add reaction</interface>.</para>
es: <para>El paso limpiarTexto esperará a que el usuario active la acción de limpiar (es decir, hacer click en el botón <interface>Limpiar</interface> de la barra de herramientas o en <interface>Archivo|Limpiar</interface> en el menú).</para> <para>Así que tenemos que añadir una reacción al paso limpiarTexto. Igual que hicimos con el paso start, selecciona el paso limpiarTexto en la vista de árbol del tutorial y haz click en <interface>Añadir reacción</interface>.</para>

# @info
source: <para>Again, to wait for something to happen we have to add a condition. And again, that condition is a signal being emitted.</para> <para>Add a new condition to wait for a signal and edit it to set its parameters.</para>
es: <para>De nuevo, para esperar a que ocurra algo tenemos que añadir una condición. Y de nuevo, la condición es que se emita una señal.</para> <para>Añade una nueva condición para esperar por una señal y edítala para establecer sus parámetros.</para>

# @info
source: <para>Usually, buttons in tool bars and menu entries are graphical representations of the so called <emphasis>actions</emphasis>. Actions are commands given to the application, for example, <emphasis>add step</emphasis> or <emphasis>save file</emphasis>, and they behave the same no matter if they were triggered from a tool bar or from the menu.</para> <para>So, as a rule of thumb, when you expect the user to click on a menu item or in a tool bar button, wait for the <emphasis>triggered()</emphasis> signal of the action they represent, instead of the <emphasis>clicked()</emphasis> signal of the button.</para> <para>In this case, the object name of the action is just <emphasis>clear</emphasis>. Set it in the emitter name, set the signal name to <emphasis>triggered()</emphasis> and accept the dialog.</para>
es: <para>Por lo general, los botones de las barras de herramientas y las entradas de menú son representaciones gráficas de las llamadas <emphasis>acciones</emphasis>. Las acciones son órdenes dadas a la aplicación, por ejemplo, <emphasis>añadir paso</emphasis> o <emphasis>guardar archivo</emphasis>, y se comportan de la misma manera sin importar si fueron activadas desde la barra de herramientas o desde el menú.</para> <para>Así que, como regla general, cuando el usuario vaya a hacer click en un elemento del menú o en un botón de la barra de herramientas, espera por la señal <emphasis>triggered()</emphasis> de la acción que representan, en lugar de la señal <emphasis>clicked()</emphasis> del botón.</para> <para>En este caso, el nombre del objeto de la acción es <emphasis>clear</emphasis>. Ponlo como nombre del emisor, pon <emphasis>triggered()</emphasis> como nombre de la señal y acepta el diálogo.</para>

# @info
source: <para>This time there is nothing else to be checked once the condition is met. When the clear action is triggered the text area is cleared, so the signal being emitted is enough to change to the next step in the tutorial.</para> <para>Just set the name of the step to change to, which we will call <emphasis>end</emphasis>, in the <link url="widget:responseStepLineEdit"><interface>change to step</interface> field</link> and accept the dialog.</para>
es: <para>Esta vez no hay nada más que comprobar una vez que se cumple la condición. Cuando la acción de limpiar se activa el área de texto se limpia, por lo que el que se emita la señal es suficiente para cambiar al siguiente paso del tutorial.</para> <para>Simplemente establece el nombre del paso al que cambiar, que llamaremos <emphasis>fin</emphasis>, en el <link url="widget:responseStepLineEdit">campo <interface>cambiar al paso</interface></link> y acepta el diálogo.</para>

# @info
source: <para>We are almost done. Add another step, the last one.</para>
es: <para>Ya terminamos. Añade otro paso, el último.</para>

# @info
source: <para>Set the id of the step to <emphasis>end</emphasis> and its text to <emphasis>And that's all. Now you can close the tutorial.</emphasis>, then accept the dialog.</para>
es: <para>Pon <emphasis>fin</emphasis> como identificador del paso y <emphasis>Eso es todo. Ahora puedes cerrar el tutorial.</emphasis> como el texto, luego acepta el diálogo.</para>

# @info
source: <para>The last step does not need a reaction, as it just informs the user that the tutorial has ended and that it can be closed.</para> <para>Finally, to install the tutorial you have just made you would have to export it (<interface>File|Export...</interface> or <interface>Export</interface> button in the tool bar) to a Javascript file and save it in the tutorials subdirectory of the data directory of KTutorial test application.</para> <para>Of course, this is too cumbersome to test a tutorial while it is being designed. <application>KTutorial editor</application> is able to launch an application and start the tutorial being designed on it, but this will be shown in another tutorial.</para> <para>That's all, this basic <application>KTutorial editor</application> walkthrough ends here.</para>
es: <para>El último paso no necesita ninguna reacción, ya que simplemente informa al usuario de que se terminó el tutorial y que puede cerrarse.</para> <para>Finalmente, para instalar el tutorial que acabas de hacer tendrías que exportarlo (<interface>Archivo|Exportar...</interface> o botón <interface>Exportar</interface> de la barra de herramientas) a un archivo Javascript y guardarlo en el subdirectorio tutorials del directorio de datos de la aplicación de prueba de KTutorial.</para> <para>Por supuesto, eso es demasiado engorroso para probar un tutorial mientras se está diseñando. <application>KTutorial editor</application> puede lanzar una aplicación y comenzar el tutorial que se está diseñando en ella, pero esto se mostrará en otro tutorial.</para> <para>Y eso es todo, este recorrido básico por <application>KTutorial editor</application> termina aquí.</para>

source: Interacting with the target application
es: Interactuando con la aplicación objetivo

source: This tutorial shows how KTutorial editor can interact with the target application of a tutorial, for example, to show the object names or test the tutorial without installing it.
es: Este tutorial muestra cómo puede interactuar KTutorial editor con la aplicación objetivo de un tutorial para, por ejemplo, mostrar los nombres de los objetos o probar el tutorial sin instalarlo.

# @info
source: <para>Welcome to the tutorial to learn how <application>KTutorial editor</application> can interact with the target application.</para> <para>The target application is the one that the tutorial is being designed for. <application>KTutorial editor</application> can "talk" with target applications to provide some useful features when designing a tutorial.</para> <para>To see these features we will design a tutorial for <application>KTutorial editor</application> itself that asks the user to add a new step and accept the step dialog.</para> <para>Let's begin by <link url="widget:addStepToolButton">adding a new step</link>.</para>
es: <para>Bienvenido al tutorial para aprender cómo puede interactuar <application>KTutorial editor</application> con la aplicación objetivo.</para> <para>La aplicación objetivo es aquélla para la que se está diseñando el tutorial. <application>KTutorial editor</application> puede "hablar" con las aplicaciones objetivo para ofrecer ciertas funcionalidades útiles a la hora de diseñar un tutorial.</para> <para>Para ver estas características diseñaremos un tutorial para el propio <application>KTutorial editor</application> que pida al usuario añadir un nuevo paso y aceptar el diálogo del paso.</para> <para>Comencemos por <link url="widget:addStepToolButton">añadir un nuevo paso</link>.</para>

# @info
source: <para>Set the <link url="widget:idLineEdit">id of the step</link> to <emphasis>start</emphasis>.</para>
es: <para>Pon <emphasis>start</emphasis> como <link url="widget:idLineEdit">identificador del paso</link>.</para>

# @info
source: <para>Set the <link url="widget:textTextEdit">text of the step</link> to:</para> <para><emphasis>Add a new step.</emphasis></para>
es: <para>Pon como <link url="widget:textTextEdit">texto del paso</link>:</para> <para><emphasis>Añade un nuevo paso.</emphasis></para>

source: Add a new step.
es: Añade un nuevo paso.

# @info
source: <para>And finally accept the dialog clicking in the <link url="widget:okButton"><interface>Ok</interface> button</link>.</para>
es: <para>Y finalmente acepta el diálogo haciendo click en el <link url="widget:okButton">botón <interface>Aceptar</interface></link>.</para>

# @info
source: <para>Now, select the <emphasis>start</emphasis> step and add a new reaction to it.</para>
es: <para>Ahora, selecciona el paso <emphasis>start</emphasis> y añádele una nueva reacción.</para>

# @info
source: <para>Set the trigger type to <link url="widget:triggerConditionRadioButton"><interface>condition met</interface></link>.</para>
es: <para>Establece el tipo de activador como <link url="widget:triggerConditionRadioButton"><interface>condición cumplida</interface></link>.</para>

# @info
source: <para><link url="widget:addButton"><interface>Add</interface></link> a new condition.</para>
es: <para><link url="widget:addButton"><interface>Añade</interface></link> una nueva condición.</para>

# @info
source: <para>We want the step to react when the dialog to add a new step is shown, so select <emphasis>The specified window is shown</emphasis> in the <link url="widget:waitForTypeComboBox">combo box</link>.</para>
es: <para>Queremos que el paso reaccione cuando se muestre el diálogo para añadir un nuevo paso, así que selecciona <emphasis>Se muestra la ventana especificada</emphasis> en la <link url="widget:waitForTypeComboBox">lista desplegable</link>.</para>

# @item:inlistbox
source: The specified window is shown
es: Se muestra la ventana especificada

# @info
source: <para><link url="widget:addWaitForDialog/okButton">Accept the dialog</link> to add the condition to wait for.</para>
es: <para><link url="widget:addWaitForDialog/okButton">Acepta el diálogo</link> para añadir la condición por la que esperar.</para>

# @info
source: <para>Select the condition just added and <link url="widget:editButton">edit</link> it.</para>
es: <para>Selecciona la condición que acabas de añadir y <link url="widget:editButton">edítala</link>.</para>

# @info
source: <para>Now it is time to set the name of the window/dialog that we want to wait for. We asked the user to add a new step, so we want to wait for the dialog that appears when <interface>Add step</interface> is clicked. But... what is the object name of that dialog (note that the object name is not the title)?</para> <para>Usually the name of the objects (windows, widgets...) will be quite descriptive, so we can suppose how it will look like. However, a name that <emphasis>is something like...</emphasis> is not enough, we need the exact name.</para> <para><application>KTutorial editor</application> is able to show you a list with all the objects in the target application that KTutorial can access to.</para> <para>Click on <link url="widget:objectNamePushButton">Choose...</link> to select the object from the list.</para>
es: <para>Ahora es el momento de establecer el nombre de la ventana/diálogo por la que queremos esperar. Pedimos al usuario que añadiese un nuevo paso, así que queremos esperar por el diálogo que aparece cuando se hace click en <interface>Añadir paso</interface>. Pero... ¿cuál es el nombre de objeto de ése diálogo (téngase en cuenta que el nombre de objeto no es el título)?</para> <para>Generalmente el nombre de los objetos (ventanas, widgets...) será bastante descriptivo, por lo que podemos suponer qué pinta tendrá. Sin embargo, un nombre que <emphasis>es algo así como...</emphasis> no es suficiente, necesitamos el nombre exacto.</para> <para><application>KTutorial editor</application> es capaz de mostrarte una lista con todos los objetos de la aplicación objetivo a los que KTutorial tiene acceso.</para> <para>Haz click en <link url="widget:objectNamePushButton">Escoger...</link> para seleccionar el objeto de la lista.</para>

# @info
source: <para>To show you the list with the objects in the target application <application>KTutorial editor</application> needs to know which one is the target application. You can select it from the list of known applications or set its executable name.</para> <para>Once the target application is set <application>KTutorial editor</application> will start a new instance of that application to "talk" with it.</para> <para>The target application of this tutorial is <application>KTutorial editor</application> itself, so select it in the list or write <emphasis>ktutorial-editor</emphasis> (which is the name of its executable) in the text line, then accept the dialog.</para>
es: <para>Para mostrarte la lista con los objetos de la aplicación objetivo <application>KTutorial editor</application> tiene que saber cuál es la aplicación objetivo. Puedes seleccionarla de la lista de aplicaciones conocidas o establecer el nombre de su ejecutable.</para> <para>Una vez que se establezca la aplicación objetivo <application>KTutorial editor</application> arrancará una nueva instancia de esa aplicación para "hablar" con ella.</para> <para>La aplicación objetivo de este tutorial es el propio <application>KTutorial editor</application>, así que selecciónalo en la lista o escribe <emphasis>ktutorial-editor</emphasis> (que es el nombre de su ejecutable) en la línea de texto, luego acepta el diálogo.</para>

# @info
source: <para><application>KTutorial editor</application> needs to know which application is the target application of the tutorial to "talk" with it.</para> <para>It seems that you already had selected the target application before starting this tutorial. Unfortunately, if the target application already selected is not <application>KTutorial editor</application>, you will have to close this tutorial and that target application, create a new tutorial (using <interface>File|New</interface>, or <interface>New</interface> in the tool bar) and start this tutorial again.</para> <para>Yes, I guess I should have warned you about this when you started this tutorial :P</para>
es: <para><application>KTutorial editor</application> tiene que saber qué aplicación es la aplicación objetivo del tutorial para "hablar" con ella.</para> <para>Parece que ya habías seleccionado la aplicación objetivo antes de empezar este tutorial. Desafortunadamente, si la aplicación objetivo ya seleccionada no es <application>KTutorial editor</application>, tendrás que cerrar este tutorial y esa aplicación objetivo, crear un nuevo tutorial (mediante <interface>>Archivo|Nuevo</interface>, o <interface>Nuevo</interface> en la barra de herramientas) y empezar este tutorial de nuevo.</para> <para>Sí, supongo que tendría que haberte avisado de esto cuando empezaste este tutorial :P</para>

# @action Tutorial option
source: Continue
es: Continuar

# @info
source: <para>Now you have the list with the objects that KTutorial can access in the target application.</para> <para>Note that when you select a widget in the list the widget is highlighted in the target application. For example, select the object named <emphasis>centralTreeView</emphasis>. You will see that, in the target application, the tree view that shows the tutorial being designed is highlighted.</para> <para>The list also shows the parent/child relationship between objects. For example, select <emphasis>editTutorialDock</emphasis>. The whole dock is highlighted.</para> <para>Now, select the unnamed object from the ActionListWidget class that appears in the list as a child element of the <emphasis>editTutorialDock</emphasis>. Now only the buttons in the dock are highlighted, as they are part of that widget.</para> <para>And finally, if you select the <emphasis>setTutorialInformationToolButton</emphasis> element, only the button to set the information of the tutorial will be highlighted.</para>
es: <para>Ahora ya tienes la lista con los objetos a los que KTutorial puede acceder en la aplicación objetivo.</para> <para>Ten en cuenta que cuando seleccionas un widget en la lista el widget se remarca en la aplicación objetivo. Por ejemplo, selecciona el objeto llamado <emphasis>centralTreeView</emphasis>. Verás que, en la aplicación objetivo, se remarca la vista en árbol que muestra el tutorial que se está diseñando.</para> <para>La lista también muestra la relación padre/hijo entre los objetos. Por ejemplo, selecciona <emphasis>editTutorialDock</emphasis>. Se remarca todo el panel de acoplamiento.</para> <para>Ahora, selecciona el objeto sin nombre de la clase ActionListWidget que aparece en la lista como elemento hijo de <emphasis>editTutorialDock</emphasis>. Ahora sólo se remarcan los botones del panel de acoplamiento, ya que son parte de ese widget.</para> <para>Y finalmente, si seleccionas el elemento <emphasis>setTutorialInformationToolButton</emphasis>, sólo se remarcará el botón para establecer la información del tutorial.</para>

# @info
source: <para>You may have noticed that the list does not contain the object we are looking for, that is, the dialog that is shown to add a new step. The reason is that the list does not contain all the objects that may exist in the target application at any time. Instead, it is dynamic. When a new object is added or an existing one removed from the target application the list reflects that.</para> <para>So, in the target application, show the dialog to add a new step. Once you do this, a new object (and all its children) will be added to the end of the list. The object is called <emphasis>StepDataDialog</emphasis> and, yes, it is the dialog that has just been shown.</para> <para>Select the <emphasis>StepDataDialog</emphasis> element in the list and <link url="widget:RemoteObjectChooser/okButton">accept the dialog</link>.</para>
es: <para>Puede que te hayas dado cuenta de que la lista no contiene el objeto que estamos buscando, es decir, el diálogo que se muestra para añadir un nuevo paso. El motivo es que la lista no contiene todos los objetos que puedan existir en la aplicación en cualquier momento. En cambio, es dinámica. Cuando se añade un objeto o se elimina uno existente de la aplicación objetivo la lista lo refleja.</para> <para>Así que, en la aplicación objetivo, muestra el diálogo para añadir un nuevo paso. Cuando lo hagas un nuevo objeto (y todos sus hijos) se añadirá al al final de la lista. El objeto se llama <emphasis>StepDataDialog</emphasis> y, sí, es el diálogo que se acaba de mostrar.</para> <para>Selecciona el elemento <emphasis>StepDataDialog</emphasis> en la lista y <link url="widget:RemoteObjectChooser/okButton">acepta el diálogo</link>.</para>

# @info
source: <para>Now that the name of the window was set <link url="widget:editWaitForWindowDialog/okButton">accept the dialog</link>.</para>
es: <para>Ahora que se estableció el nombre de la ventana <link url="widget:editWaitForWindowDialog/okButton">acepta el diálogo.</link>.</para>

# @info
source: <para>We want to change to another step when the window is shown, so now it is time to set the name of that other step.</para> <para>Set the <link url="widget:responseStepLineEdit">step to change to</link> to <emphasis>acceptDialog</emphasis>.</para>
es: <para>Queremos cambiar a otro paso cuando se muestre la ventana, así que ahora es el momento de poner el nombre de ese otro paso.</para> <para>Pon <emphasis>acceptDialog</emphasis> como el <link url="widget:responseStepLineEdit">paso al que cambiar</link>.</para>

# @info
source: <para>And finally <link url="widget:okButton">accept the dialog</link>.</para>
es: <para>Y finalmente <link url="widget:okButton">acepta el diálogo</link>.</para>

# @info
source: <para>We are done with the first step. Now we will take care of the second one, that will wait until the user accepts the dialog.</para> <para>Of course, the first thing to do is to <link url="widget:addStepToolButton">add a new step</link>.</para>
es: <para>Ya terminamos con el primer paso. Ahora nos encargaremos del segundo, que esperará hasta que el usuario acepte el diálogo.</para> <para>Por supuesto, lo primero que hay que hacer es <link url="widget:addStepToolButton">añadir un nuevo paso</link>.</para>

# @info
source: <para>Set the <link url="widget:idLineEdit">id of the step</link> to <emphasis>acceptDialog</emphasis>.</para>
es: <para>Pon <emphasis>acceptDialog</emphasis> como el <link url="widget:idLineEdit">identificador del paso</link>.</para>

# @info
source: <para>Set the <link url="widget:textTextEdit">text of the step</link> to:</para> <para><emphasis>Set the id to &lt;emphasis&gt;start&lt;/emphasis&gt; and the text to &lt;emphasis&gt;First step&lt;/emphasis&gt;, then accept the dialog.</emphasis></para> <para>Remember that you can copy the text above and paste it in the text area, you don't need to write it yourself.</para>
es: <para>Pon como <link url="widget:textTextEdit">texto del paso</link>:</para> <para><emphasis>Pon &lt;emphasis&gt;start&lt;/emphasis&gt; como identificador y &lt;emphasis&gt;Primer paso&lt;/emphasis&gt; como texto, luego acepta el diálogo.</emphasis></para> <para>Recuerda que puedes copiar el texto de encima y pegarlo en el área de texto, no tienes que escribirlo por ti mismo.</para>

source: Set the id to &lt;emphasis&gt;start&lt;/emphasis&gt; and the text to &lt;emphasis&gt;First step&lt;/emphasis&gt;, then accept the dialog.
es: Pon &lt;emphasis&gt;start&lt;/emphasis&gt; como identificador y &lt;emphasis&gt;Primer paso&lt;/emphasis&gt; como texto, luego acepta el diálogo.

# @info
source: <para>Now, select the <emphasis>acceptDialog</emphasis> step and add a new reaction to it.</para>
es: <para>Ahora, selecciona el paso <emphasis>acceptDialog</emphasis> y añádele una nueva reacción.</para>

# @info
source: <para>To wait for the user to accept the dialog we will wait for the user to click on the <interface>Ok</interface> button.</para> <para>Buttons emit a signal whenever they are clicked, so select <emphasis>The specified signal is emitted</emphasis> in the <link url="widget:waitForTypeComboBox">combo box</link>.</para>
es: <para>Para esperar a que el usuario acepte el diálogo esperaremos a que el usuario haga click en el botón <interface>Aceptar</interface>.</para> <para>Los botones emiten una señal cuando se hace click en ellos, así que selecciona <emphasis>Se emite la señal especificada</emphasis> en la <link url="widget:waitForTypeComboBox">lista desplegable</link>.</para>

# @item:inlistbox
source: The specified signal is emitted
es: Se emite la señal especificada
