Repository: KDE/ktutorial
Catalog: ktutorial-editor/doc/*/ktutorial-editor-handbook.po
Languages: es

source: Command Reference
es: Referencia de órdenes

source: The main &ktutorial-editor; window
es: La ventana principal de &ktutorial-editor;

source: The <guimenu>File</guimenu> Menu
es: El menú <guimenu>Archivo</guimenu>

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>New</guimenuitem>
es: <shortcut> <keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo> </shortcut> <guimenu>Archivo</guimenu> <guimenuitem>Nuevo</guimenuitem>

source: Creates a new tutorial.
es: Crea un nuevo tutorial.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>O</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Open...</guimenuitem>
es: <shortcut> <keycombo action="simul">&Ctrl;<keycap>O</keycap></keycombo> </shortcut> <guimenu>Archivo</guimenu> <guimenuitem>Abrir...</guimenuitem>

source: Opens a saved tutorial.
es: Abre un tutorial guardado.

source: <guimenu>File</guimenu> <guimenuitem>Open Recent</guimenuitem>
es: <guimenu>Archivo</guimenu> <guimenuitem>Abrir reciente</guimenuitem>

source: Opens a tutorial from the list of the most recently used tutorials.
es: Abre un tutorial de la lista de los tutoriales usados más recientemente.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>S</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Save</guimenuitem>
es: <shortcut> <keycombo action="simul">&Ctrl;<keycap>S</keycap></keycombo> </shortcut> <guimenu>Archivo</guimenu> <guimenuitem>Guardar</guimenuitem>

source: Saves the tutorial to the current file.
es: Guarda el tutorial al archivo actual.

source: <guimenu>File</guimenu> <guimenuitem>Save As...</guimenuitem>
es: <guimenu>Archivo</guimenu> <guimenuitem>Guardar como...</guimenuitem>

source: Saves the tutorial to the selected file.
es: Guarda el tutorial en el archivo seleccionado.

source: <guimenu>File</guimenu> <guimenuitem>Export...</guimenuitem>
es: <guimenu>Archivo</guimenu> <guimenuitem>Exportar...</guimenuitem>

source: Exports the tutorial to a script.
es: Exporta el tutorial a un script.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Quit</guimenuitem>
es: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo> </shortcut> <guimenu>Archivo</guimenu> <guimenuitem>Salir</guimenuitem>

source: Quits &ktutorial-editor;.
es: Sale de &ktutorial-editor;.

source: The <guimenu>Edit</guimenu> Menu
es: El menú <guimenu>Editar</guimenu>

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Z</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Undo</guimenuitem>
es: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Z</keycap></keycombo> </shortcut> <guimenu>Editar</guimenu> <guimenuitem>Deshacer</guimenuitem>

source: Undoes the last edition action not undone yet.
es: Deshace la última acción de edición no deshecha todavía.

source: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>Z</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Redo</guimenuitem>
es: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>Z</keycap></keycombo> </shortcut> <guimenu>Editar</guimenu> <guimenuitem>Rehacer</guimenuitem>

source: Does again the last undone edition action not redone yet.
es: Hace de nuevo la última acción de edición deshecha y no rehecha aún.

source: <guimenu>Edit</guimenu> <guimenu>Tutorial</guimenu> <guimenuitem>Set information...</guimenuitem>
es: <guimenu>Editar</guimenu> <guimenu>Tutorial</guimenu> <guimenuitem>Establecer información...</guimenuitem>

source: Opens the dialog to set the name and description of the tutorial.
es: Abre el diálogo para establecer el nombre y la descripción del tutorial.

source: <guimenu>Edit</guimenu> <guimenu>Tutorial</guimenu> <guimenuitem>Set license...</guimenuitem>
es: <guimenu>Editar</guimenu> <guimenu>Tutorial</guimenu> <guimenuitem>Establecer licencia...</guimenuitem>

source: Opens the dialog to set the license text of the tutorial.
es: Abre el diálogo para establecer el texto de la licencia del tutorial.

source: <guimenu>Edit</guimenu> <guimenu>Tutorial</guimenu> <guimenuitem>Set setup code...</guimenuitem>
es: <guimenu>Editar</guimenu> <guimenu>Tutorial</guimenu> <guimenuitem>Establecer código de inicialización...</guimenuitem>

source: Opens the dialog to set the custom code to be executed when the tutorial starts.
es: Abre el diálogo para establecer el código propio que se ejecutará cuando comience el tutorial.

source: <guimenu>Edit</guimenu> <guimenu>Tutorial</guimenu> <guimenuitem>Set tear down code...</guimenuitem>
es: <guimenu>Editar</guimenu> <guimenu>Tutorial</guimenu> <guimenuitem>Establecer código de finalización...</guimenuitem>

source: Opens the dialog to set the custom code to be executed when the tutorial finishes.
es: Abre el diálogo para establecer el código propio que se ejecutará cuando termine el tutorial.

source: <guimenu>Edit</guimenu> <guimenu>Step</guimenu> <guimenuitem>Add step...</guimenuitem>
es: <guimenu>Editar</guimenu> <guimenu>Paso</guimenu> <guimenuitem>Añadir paso...</guimenuitem>

source: Opens the dialog to add a new step to the tutorial.
es: Abre el diálogo para añadir un nuevo paso al tutorial.

source: <guimenu>Edit</guimenu> <guimenu>Step</guimenu> <guimenuitem>Set data...</guimenuitem>
es: <guimenu>Editar</guimenu> <guimenu>Paso</guimenu> <guimenuitem>Establecer datos...</guimenuitem>

source: Opens the dialog to set the name and text of the currently selected step.
es: Abre el diálogo para establecer el nombre y el texto del paso seleccionado actualmente.

source: <guimenu>Edit</guimenu> <guimenu>Step</guimenu> <guimenuitem>Set setup code...</guimenuitem>
es: <guimenu>Editar</guimenu> <guimenu>Paso</guimenu> <guimenuitem>Establecer código de inicialización...</guimenuitem>

source: Opens the dialog to set the custom code to be executed when the tutorial passes to the currently selected step.
es: Abre el diálogo para establecer el código propio que se ejecutará cuando el tutorial cambie al paso seleccionado actualmente.

source: <guimenu>Edit</guimenu> <guimenu>Step</guimenu> <guimenuitem>Set tear down code...</guimenuitem>
es: <guimenu>Editar</guimenu> <guimenu>Paso</guimenu> <guimenuitem>Establecer código de finalización...</guimenuitem>

source: Opens the dialog to set the custom code to be executed when the tutorial changes from the currently selected step to another step.
es: Abre el diálogo para establecer el código propio que se ejecutará cuando el tutorial cambie del paso seleccionado actualmente a otro paso.

source: <guimenu>Edit</guimenu> <guimenu>Step</guimenu> <guimenuitem>Remove step</guimenuitem>
es: <guimenu>Editar</guimenu> <guimenu>Paso</guimenu> <guimenuitem>Eliminar paso</guimenuitem>

source: Removes the currently selected step from the tutorial.
es: Elimina del tutorial el paso seleccionado actualmente.

source: <guimenu>Edit</guimenu> <guimenu>Reaction</guimenu> <guimenuitem>Add reaction...</guimenuitem>
es: <guimenu>Editar</guimenu> <guimenu>Reacción</guimenu> <guimenuitem>Añadir reacción...</guimenuitem>

source: Opens the dialog to add a new reaction to the selected step.
es: Abre el diálogo para añadir una nueva reacción al paso seleccionado.

source: <guimenu>Edit</guimenu> <guimenu>Reaction</guimenu> <guimenuitem>Set data...</guimenuitem>
es: <guimenu>Editar</guimenu> <guimenu>Reacción</guimenu> <guimenuitem>Establecer datos...</guimenuitem>

source: Opens the dialog to set the trigger and response of the currently selected reaction.
es: Abre el diálogo para establecer el activador y la respuesta de la reacción seleccionada actualmente.

source: <guimenu>Edit</guimenu> <guimenu>Reaction</guimenu> <guimenuitem>Remove reaction</guimenuitem>
es: <guimenu>Editar</guimenu> <guimenu>Reacción</guimenu> <guimenuitem>Eliminar reacción</guimenuitem>

source: Removes the currently selected reaction from its step.
es: Elimina de su paso la reacción seleccionada actualmente.

source: <guimenu>Edit</guimenu> <guimenuitem>Test tutorial</guimenuitem>
es: <guimenu>Editar</guimenu> <guimenuitem>Probar tutorial</guimenuitem>

source: Starts the tutorial in the target application.
es: Empieza el tutorial en la aplicación objetivo.

source: <guimenu>Edit</guimenu> <guimenuitem>Test tutorial from current step</guimenuitem>
es: <guimenu>Editar</guimenu> <guimenuitem>Probar tutorial desde el paso actual</guimenuitem>

source: Starts the tutorial in the target application from the currently selected step.
es: Empieza el tutorial en la aplicación objetivo desde el paso seleccionado actualmente.

source: The <guimenu>View</guimenu> Menu
es: El menú <guimenu>Ver</guimenu>

source: <guimenu>View</guimenu> <guimenuitem>Panels</guimenuitem> <guimenuitem>Edit tutorial</guimenuitem>
es: <guimenu>Ver</guimenu> <guimenuitem>Paneles</guimenuitem> <guimenuitem>Editar tutorial</guimenuitem>

source: Shows or hides the panel with the shorcuts to tutorial edition actions.
es: Muestra u oculta el panel con los accesos directos a las acciones de edición del tutorial.

source: <guimenu>View</guimenu> <guimenuitem>Panels</guimenuitem> <guimenuitem>Edit step</guimenuitem>
es: <guimenu>Ver</guimenu> <guimenuitem>Paneles</guimenuitem> <guimenuitem>Editar paso</guimenuitem>

source: Shows or hides the panel with the shorcuts to step edition actions.
es: Muestra u oculta el panel con los accesos directos a las acciones de edición de los pasos.

source: <guimenu>View</guimenu> <guimenuitem>Panels</guimenuitem> <guimenuitem>Edit reaction</guimenuitem>
es: <guimenu>Ver</guimenu> <guimenuitem>Paneles</guimenuitem> <guimenuitem>Editar reacción</guimenuitem>

source: Shows or hides the panel with the shorcuts to reaction edition actions.
es: Muestra u oculta el panel con los accesos directos a las acciones de edición de las reacciones.

source: The <guimenu>Settings</guimenu> Menu
es: El menú <guimenu>Preferencias</guimenu>

source: <guimenu>Settings</guimenu> <guimenuitem>Show Toolbar</guimenuitem>
es: <guimenu>Preferencias</guimenu> <guimenuitem>Mostrar la barra de herramientas</guimenuitem>

source: Shows or hides the main toolbar.
es: Muestra u oculta la barra de herramientas principal.

source: <guimenu>Settings</guimenu> <guimenuitem>Show Statusbar</guimenuitem>
es: <guimenu>Preferencias</guimenu> <guimenuitem>Mostrar barra de estado</guimenuitem>

source: Shows or hides the statusbar.
es: Muestra u oculta la barra de estado.

source: <guimenu>Settings</guimenu> <guimenuitem>Configure Shortcuts...</guimenuitem>
es: <guimenu>Preferencias</guimenu> <guimenuitem>Configurar los accesos rápidos...</guimenuitem>

source: Opens a configure dialog for binding keys to actions.
es: Abre el diálogo de configuración para asociar teclas con acciones.

source: <guimenu>Settings</guimenu> <guimenuitem>Configure Toolbars...</guimenuitem>
es: <guimenu>Preferencias</guimenu> <guimenuitem>Configurar las barras de herramientas...</guimenuitem>

source: Opens a configure dialog for selecting the actions to show in the toolbar.
es: Abre el diálogo de configuración para seleccionar las acciones a mostrar en la barra de herramientas.

source: The <guimenu>Help</guimenu> Menu
es: El menú <guimenu>Ayuda</guimenu>

source: The &ktutorial-editor; Handbook
es: Manual de &ktutorial-editor;

source: ROLES_OF_TRANSLATORS
es: <othercredit role="translator"> <firstname>Daniel</firstname> <surname>Calviño Sánchez</surname> <contrib>Traducción</contrib> <email>danxuliu@gmail.com</email></othercredit>

source: &ktutorial-editor; is a graphical editor for KTutorial tutorials.
es: &ktutorial-editor; es un editor gráfico de tutoriales para KTutorial.

source: Introduction
es: Introducción

source: KTutorial is a interactive tutorial system for KDE 4. You can get more information about KTutorial in its webpage: <ulink url="http://ktutorial.sourceforge.net">http://ktutorial.sourceforge.net</ulink>.
es: Ktutorial es un sistema de tutoriales interactivos para KDE 4. Puedes conseguir más información sobre KTutorial en su página web: <ulink url="http://ktutorial.sourceforge.net">http://ktutorial.sourceforge.net</ulink>.

source: Using &ktutorial-editor; you can design a tutorial for some application specifying the steps that it will be composed of. For each step, you can specify how the tutorial will react, for example, when the user selects an option, closes a dialog, writes some text...
es: Mediante &ktutorial-editor; puedes diseñar un tutorial para cierta aplicación indicando los pasos de los que estará compuesto. Para cada paso, puedes indicar cómo reaccionará el tutorial, por ejemplo, cuando el usuario seleccione una opción, cierre un diálogo, escriba cierto texto...

source: Once the tutorial has been designed, it can be exported by &ktutorial-editor; to a scripted tutorial. Once the scripted tutorial is placed in the appropriate directory, it can be read by KTutorial library and started by the user of the application.
es: Una vez que el tutorial haya sido diseñado, puede ser exportado mediante &ktutorial-editor; a un tutorial en script. Una vez colocado el tutorial en script en el directorio apropiado éste puede ser leído por la biblioteca de KTutorial y el usuario de la aplicación podrá comenzar el tutorial.

source: Tutorials created by &ktutorial-editor; are not as powerful as fully hand made tutorials. However, they are way easier to create and the generated source code can be used as a skeleton to be manually completed if the tutorial requires something not supported by &ktutorial-editor;.
es: Los tutoriales creados mediante &ktutorial-editor; no son tan potentes como los tutoriales hechos completamente a mano. Sin embargo, son mucho más fáciles de crear y el código fuente generado puede utilizarse como un esqueleto a completar manualmente si el tutorial requiere algo no soportado por &ktutorial-editor;.

source: Credits and License
es: Créditos y licencia

source: Program Copyright 2010-2012 Daniel Calviño Sánchez <email>danxuliu@gmail.com</email>
es: Programa Copyright 2010-2012 Daniel Calviño Sánchez <email>danxuliu@gmail.com</email>

source: Documentation Copyright 2010-2012 Daniel Calviño Sánchez <email>danxuliu@gmail.com</email>
es: Documentación Copyright 2010-2012 Daniel Calviño Sánchez <email>danxuliu@gmail.com</email>

source: CREDIT_FOR_TRANSLATORS
es: <para>Traducción Daniel Calviño Sánchez <email>danxuliu@gmail.com</email></para>

source: Installation
es: Instalación

source: How to obtain &ktutorial-editor;
es: Cómo obtener &ktutorial-editor;

source: &ktutorial-editor; is part of KTutorial package, which is hosted at <ulink url="http://sourceforge.net/">SourceForge.net</ulink>.
es: &ktutorial-editor; es parte del paquete KTutorial, hospedado en <ulink url="http://sourceforge.net/">SourceForge.net</ulink>.

source: KTutorial can be downloaded from the <ulink url="http://sourceforge.net/projects/ktutorial/files/">files section</ulink> of the <ulink url="http://sourceforge.net/projects/ktutorial/">KTutorial project in SourceForge.net</ulink>.
es: KTutorial puede descargarse desde la <ulink url="http://sourceforge.net/projects/ktutorial/files/">sección de archivos</ulink> del <ulink url="http://sourceforge.net/projects/ktutorial/">proyecto KTutorial en SourceForge.net</ulink>.

source: You are encouraged to visit, however, the <ulink url="http://ktutorial.sourceforge.net/download.html">download section</ulink> of the <ulink url="http://ktutorial.sourceforge.net/">webpage</ulink>, as a lot more information can be found there apart of only the files.
es: Se recomienda visitar, no obstante, la <ulink url="http://ktutorial.sourceforge.net/download.html">sección de descargas</ulink> de la <ulink url="http://ktutorial.sourceforge.net/">página web</ulink>, ya que puede encontrarse mucha más información además de simplemente los archivos.

source: If you are brave enough, in the download section you will also find instructions to install KTutorial from <acronym>SVN</acronym>. However, this is only recommended for developers.
es: Si eres suficientemente valiente, en la sección de descargas también encontrarás instrucciones para instalar KTutorial desde <acronym>SVN</acronym>. No obstante, esto sólo se recomienda a desarrolladores.

source: Requirements
es: Requisitos

source: In order to successfully build and use KTutorial, you need &kde; (at least version 4.3) and, therefore, &Qt; (at least version 4.6).
es: Para poder compilar y utilizar KTutorial con éxito, necesitas &kde; (al menos la versión 4.3) y, por tanto, &Qt; (al menos la versión 4.6).

source: To use the full feature set of &ktutorial-editor; you will also need the QtDBus module of Qt, only available in Unix systems. Without that module &ktutorial-editor; can not talk to the target application, for example to know the name of its objects.
es: Para utilizar todas las funcionalidades de &ktutorial-editor; también necesitarás el módulo QtDBus de Qt, que sólo está disponible en sistemas Unix. Sin ese módulo &ktutorial-editor; no puede hablar con la aplicación objetivo, por ejemplo para saber el nombre de sus objetos.

source: Also, <application>CMake</application> build system is required to build KTutorial, as required to build any other &kde; application.
es: Además, el sistema de construcción <application>CMake</application> se necesita para compilar KTutorial, del mismo modo que se necesita para compilar cualquier otra aplicación de &kde;.

source: Compilation and Installation
es: Compilación e instalación

source: In order to compile KTutorial on your system, extract the KTutorial package you downloaded and type the following in the base directory of the extracted package:
es: Para compilar KTutorial en tu sistema, extrae el paquete de KTutorial que descargaste y escribe lo siguiente en el directorio base del paquete extraído:

source: That will create a <filename class="directory">build</filename> directory, change to it, prepare the build directory to build KTutorial on it and finally build KTutorial. If <command>cmake</command> complains, you have to install the required dependencies asked in the error message.
es: Esto creará un directorio <filename class="directory">build</filename>, cambiará a él, preparará el directorio para compilar KTutorial en él y finalmente compilará KTutorial. Si <command>cmake</command> se queja, tendrás que instalar las dependencias pedidas en el mensaje de error.

source: To install KTutorial, become root user and run:
es: Para instalar KTutorial, hazte usuario root y ejecuta:

source: Installing &ktutorial-editor; in <filename class="directory">/usr/local/</filename>
es: Instalar &ktutorial-editor; en <filename class="directory">/usr/local/</filename>

source: In order to keep a proper organization of your system and not mess up the packages installed by your distribution package manager and those installed manually by you, you are encouraged to install KTutorial in <filename class="directory">/usr/local/</filename>.
es: Para mantener tu sistema organizado y no enredar con los paquetes instalados por el gestor de paquetes de tu distribución y los paquetes instalados por ti, se recomienda que instales KTutorial en <filename class="directory">/usr/local/</filename>.

source: This is the directory that should be used for manually installed packages. To do this, instead of executing <command>cmake</command> as stated before, execute this:
es: Éste es el directorio que debería utilizarse para paquetes instalados manualmente. Para hacerlo, en lugar de ejecutar <command>cmake</command> como se indicó antes, ejecuta esto:

source: Configuration
es: Configuración

source: Depending on your distribution and where KTutorial was installed (if you installed it from sourcecode), you may need a last step before being able to make KTutorial run properly.
es: Dependiendo de tu distribución y de dónde se instaló KTutorial (si lo instalaste desde el código fuente), puede que tengas que realizar un último paso para que KTutorial funcione adecuadamente.

source: To check this, launch &ktutorial-editor; and take a look to the help. If &ktutorial-editor; manual cannot be found, go on reading to know what must be configured. If the manual is shown, congratulations, just enjoy! :)
es: Para comprobarlo, ejecuta &ktutorial-editor; y mira la ayuda. Si el manual de &ktutorial-editor; no se puede encontrar, sigue leyendo para saber qué tiene que configurarse. Si se muestra el manual, felicidades, ¡simplemente disfruta! :)

source: If the manual wasn't found, you must configure your &kde; prefixes. To do this, create the file <filename>/etc/kderc</filename> and add the following content:
es: Si no se encontró el manual debes configurar los prefijos de &kde;. Para hacer esto, crea el archivo <filename>/etc/kderc</filename> y añade el siguiente contenido:

source: [Directories] prefixes=/the/prefix/where/ktutorial/was/installed/
es: [Directories] prefixes=/el/prefijo/donde/se/instaló/ktutorial

source: If <filename>/etc/kderc</filename> already existed and had a prefixes rule, add the prefix of KTutorial separating it from the previous prefixes with a "," like this:
es: Si <filename>/etc/kderc</filename> ya existe y tenía una regla de prefijos previa, añade el prefijo de KTutorial separándolo de los prefijos previos con un "," de este modo:

source: [Directories] prefixes=/previous/prefixes/,/the/prefix/where/ktutorial/was/installed/
es: [Directories] prefixes=/prefijos/previos/,/el/prefijo/donde/se/instaló/ktutorial

source: Using &ktutorial-editor;
es: Utilización de &ktutorial-editor;

source: In this chapter you should find all the information you need to use &ktutorial-editor;. However, some general information about KTutorial is also given here, as it is needed to fully understand the purpose of &ktutorial-editor;.
es: En este capítulo encontrarás toda la información que necesitas para utilizar &ktutorial-editor;. No obstante, también se ofrece algo de información general sobre KTutorial, ya que es necesaria para comprender bien el propósito de &ktutorial-editor;.

source: Getting extended information
es: Obtener información extendida

source: You can also get extended information about a lot of widgets throughout &ktutorial-editor; using the <emphasis>What's This?</emphasis> help. <emphasis>What's This?</emphasis> help can be shown with the keyboard shortcut <keycombo action="simul">&Shift;<keycap>F1</keycap></keycombo>, selecting <guimenuitem>What's This?</guimenuitem> from the <guimenu>Help</guimenu> menu or, with some window decorations, clicking on the What's This? button in the window's titlebar (usually a question mark), and then clicking on the widget to get its extended help.
es: También puedes obtener información extendida sobre un montón de elementos de pantalla de &ktutorial-editor; utilizando la ayuda <emphasis>¿Qué es esto?</emphasis>. La ayuda <emphasis>¿Qué es esto?</emphasis> puede mostrarse con el atajo de teclado <keycombo action="simul">&Shift;<keycap>F1</keycap></keycombo>, seleccionando <guimenuitem>¿Qué es esto?</guimenuitem> desde el menú <guimenu>Ayuda</guimenu> o, en ciertas decoraciones de ventanas, haciendo click en el botón de ¿Qué es esto? del título de la ventana (generalmente un signo de interrogación), y luego haciendo click en el elemento de pantalla del que se desea ver la ayuda extendida.

source: Understanding KTutorial
es: Entendiendo KTutorial
