Repository: KDE/ktutorial
Catalog: ktutorial-editor/doc/*/ktutorial-editor-handbook.po
Languages: es

source: &ktutorial-editor; is just a graphical editor to create tutorials to be used by KTutorial. That is why you should at least have some little notions of how KTutorial works to fully understand the purpose of &ktutorial-editor;.
es: &ktutorial-editor; es simplemente un editor gráfico que permite crear tutoriales para ser usados por KTutorial. Es por esto que deberías tener al menos una pequeña noción de cómo funciona KTutorial para entender bien el propósito de &ktutorial-editor;.

source: A tutorial is a little guide to help the user to learn how to use an application. For example, it shows the user how some feature works, or how to accomplish some task. A tutorial is composed of several steps, each one containing a bit of information.
es: Un tutorial es una pequeña guía para ayudar al usuario a aprender a usar una aplicación. Por ejemplo, muestra al usuario cómo funciona cierta característica, o cómo llevar a cabo cierta tarea. Un tutorial está formado por varios pasos, y cada uno contiene un poco de información.

source: The most interesting feature is that, with KTutorial, applications can explain to the user how to do something in an interactive way. Each step contains one or more reactions. A reaction is composed by a trigger and a response: when the reaction is triggered, the response is executed.
es: La característica más interesante es que, mediante KTutorial, las aplicaciones pueden explicar al usuario cómo hacer algo de manera interactiva. Cada paso contiene una o más reacciones. Una reacción está formada por un activador y una respuesta: cuando se activa la reacción, se ejecuta la respuesta.

source: There are two types of triggers: options and conditions to wait for. Options are shown to the user as buttons below the text of the step, and the response is executed when the user selects the option. Conditions to wait for are not shown in any way to the user, and the response is executed when the condition is met. For example, when an object receives an event, or when an object emits a signal.
es: Hay dos tipos de activadores: opciones y condiciones por las que esperar. Las opciones se muestran al usuario como botones bajo el texto del paso, y la respuesta se ejecuta cuando el usuario selecciona la opción. Las condiciones por las que esperar no se muestran en modo alguno al usuario, y la respuesta se ejecuta cuando se cumple la condición. Por ejemplo, cuando un objeto recibe un evento, o cuando un objeto emite una señal.

source: There are also two types of responses: changing to another step, or executing some custom code.
es: Hay también dos tipos de respuestas: cambiar a otro paso, o ejecutar un código propio.

source: Finally, KTutorial provides a system to execute some actions when a tutorial starts or finishes, or when the tutorial enters or exists from a step.
es: Finalmente, KTutorial tiene un sistema para llevar a cabo ciertas acciones cuando un tutorial comienza o termina, o cuando el tutorial entra o sale de un paso.

source: All this abstract concepts are fine but, how do you tell KTutorial all those things? KTutorial is a software package, how does it know that it has to wait for something to happen, or show the user some text, or whatever? KTutorial tutorials are specified as source code, be it C++ or a script language.
es: Todos estos conceptos abstractos están muy bien, pero ¿cómo haces para decirle a KTutorial todas esas cosas? Ktutorial es un paquete de software, ¿cómo sabe que tiene que esperar a que ocurra algo, o mostrar un texto al usuario, o lo que sea? Los tutoriales de KTutorial se especifican en código fuente, ya sea C++ o un lenguaje de script.

source: C++ tutorials must be embedded in the application source code itself, and they have to be compiled with it when the application is compiled.
es: Los tutoriales en C++ deben incluirse en el código fuente de la aplicación misma, y tienen que ser compilados con ella cuando se compila la propia aplicación.

source: On the other hand, scripted tutorials are external data to the application. When an application that supports KTutorial starts, it looks for scripted tutorials in some specific directories and loads those found. If you add new scripted tutorials to the directories, the next time the application starts they will be available. You don't have to compile again the application, not even to reinstall it.
es: En cambio, los tutoriales en script son datos externos a la aplicación. Cuando arranca una aplicación que soporta KTutorial, busca tutoriales en script en unos directorios concretos y carga los que encuentre. Si añades nuevos tutoriales en script a esos directorios, dichos tutoriales estarán disponibles la próxima vez que arranques la aplicación. No tienes que compilar la aplicación de nuevo, ni siquiera reinstalarla.

source: Scripted tutorials are looked for in the <filename class="directory">tutorials/</filename> subdirectory of the application data directory. The application data directory is <filename class="directory">KDE_PREFIX/share/apps/applicationName/</filename>. Special cases aside, the <emphasis>KDE_PREFIX</emphasis> can be the &kde; installation prefix (usually <filename class="directory">/usr/</filename>) or the user &kde; configuration directory (<filename class="directory">/home/userName/.kde4/</filename>).
es: Los tutoriales en script se buscan en el subdirectorio <filename class="directory">tutorials/</filename> del directorio de datos de la aplicación. El directorio de datos de la aplicación es <filename class="directory">KDE_PREFIX/share/apps/applicationName/</filename>. Dejando a un lado las situaciones especiales, <emphasis>KDE_PREFIX</emphasis> puede ser el prefijo de instalación de &kde; (generalmente <filename class="directory">/usr/</filename>) o el directorio de configuración de &kde; del usuario (<filename class="directory">/home/userName/.kde4/</filename>).

source: When the scripted tutorial is part of an application (it is installed with the rest of the application data when the application is installed), the strings in the scripted tutorial can be extracted to be localized before the installation like any other string in the C++ code, as explained in KTutorial documentation. Scripted tutorials that are added after the application was installed, however, can not be localized, as KTutorial uses the same translation file as the rest of the application where it is used.
es: Cuando el tutorial en script es parte de una aplicación (se instala junto al resto de la aplicación cuando se instala la aplicación), las cadenas contenidas en el tutorial pueden extraerse para ser localizadas antes de la instalación como cualquier otra cadena en el código C++, como se explica en la documentación de KTutorial. Los tutoriales en script que se añaden una vez la aplicación fue instalada, sin embargo, no pueden localizarse, ya que KTutorial utiliza el mismo archivo de traducción que el resto de la aplicación en que se utiliza.

source: As you may have guessed already, &ktutorial-editor; creates scripted tutorials. Right now, only Javascript is supported by &ktutorial-editor;, as &kde; libraries offer out of the box support for Javascript scripts. Python or Ruby, on the other hand, require some specific packages to be installed in the system.
es: Como puede que ya te hayas imaginado, &ktutorial-editor; crea tutoriales en script. Por ahora, &ktutorial-editor; sólo soporta Javascript, ya que las bibliotecas de &kde; ofrecen soporte de serie para scripts en Javascript. Python o Ruby, en cambio, necesitan que ciertos paquetes concretos estén instalados en el sistema.

source: Main Window
es: Ventana principal

source: &ktutorial-editor; main window shows the tutorial being worked on, and provides actions to modify it.
es: La ventana principal de &ktutorial-editor; muestra el tutorial en el que se está trabajando, y proporciona acciones para modificarlo.

source: A tutorial can be seen as a hierarchical structure: a tutorial contains several steps, each step may contain several reactions, and each reaction may contain a composed condition. Also, tutorial, step and reactions contain other properties, like the name in a tutorial or the response code in a reaction, that can be seen as children of their element. With all this, a tutorial is shown as a tree in the main window.
es: Un tutorial puede verse como una estructura jerárquica: un tutorial contiene varios pasos, cada paso puede contener varias reacciones, y cada reacción puede contener una condición compuesta. Además, los tutoriales, pasos y reacciones contienen otras propiedades, como el nombre del tutorial o el código de respuesta de la reacción, que pueden verse como hijos del elemento al que pertenecen. Con todo esto, un tutorial se muestra en forma de árbol en la ventana principal.

source: The tree only shows properties already set. For example, if there is no custom setup code for a step, no item is shown, not even to say that there is no setup code. The exception to this behavior happens when a property is mandatory, for example, the id of a step. In that case, if the property is not set, an item with a warning is shown.
es: El árbol sólo muestra las propiedades que ya están establecidas. Por ejemplo, si no hay código propio de inicialización para un paso, no se muestra ninguna entrada para él, ni siquiera para indicar que no hay código de inicialización. La excepción que confirma la regla son las propiedades obligatorias, por ejemplo, el identificador de un paso. En ese caso, si la propiedad no está establecida, se muestra una entrada con una advertencia.

source: The actions to modify the tutorial and its elements can be always accessed from the <guimenu>Edit</guimenu> menu. Most actions will open a edition dialog to edit the desired element, which means that, in some cases, you have to select an element before being able to use an action. For example, to use <action>Set reaction data</action>, you first have to select the reaction to edit in the tutorial. Otherwise, the action will be disabled and it could not be executed (which is logical, as it will not know which reaction to edit).
es: Para acceder a las acciones que modifican el tutorial y sus elementos puede usarse siempre el menu <guimenu>Edit</guimenu>. La mayoría de las acciones abrirán un diálogo de edición para el elemento deseado, lo que implica que, en algunos casos, tendrás que seleccionar un elemento antes de poder utilizar la acción. Por ejemplo, para utilizar <action>Establecer datos de la reacción</action> antes tendrás que haber seleccionado la reacción a editar en el tutorial. De lo contrario, la acción estará desactivada y no podrá ejecutarse (lo que es lógico, ya que no sabría qué reacción editar).

source: As well as being shown in the <guimenu>Edit</guimenu> menu, the actions to edit a tutorial, a step and a reaction are shown in three panels provided for convenience. The panels can be shown or hidden from <guimenu>View</guimenu> menu, and can be docked to the top, bottom, right or left side of the main window. If desired, they can also be dragged out of the window to make them floating panels.
es: Además de mostrarse en el menú <guimenu>Edit</guimenu>, por comodidad las acciones para editar un tutorial, un paso y una reacción se muestran en tres paneles. Los paneles pueden mostrarse u ocultarse desde el menú <guimenu>Ver</guimenu>, y pueden acoplarse a la parte superior, inferior, derecha o izquierda de la ventana principal. Si se desea, pueden arrastrarse fuera de la ventana para convertirlos en paneles flotantes.

source: Every edition action can be undone and redone using the typical undo/redo system. Note, however, that the whole action is undone/redone, and not each tiny change that make up the action. That is, when an edition dialog is opened, several changes are made in the dialog, the dialog is accepted and then the action is undone, the tutorial will get back to the state it had before the edition dialog was opened, no matter what or how many changes were made while the dialog was opened.
es: Todas las acciones de edición pueden deshacerse y rehacerse utilizando el típico sistema de hacer/deshacer. Ten en cuenta, no obstante, que se deshace/rehace la acción al completo, y no cada pequeño cambio que forma la acción. Es decir, cuando se abre un diálogo de edición, se hacen diversos cambios en el diálogo, se acepta el diálogo y luego se deshace la acción, el tutorial volverá al estado que tenía antes de que se abriese el diálogo de edición, sin importar qué o cuántos cambios se hicieron mientras estaba abierto el diálogo.

source: The main window of &ktutorial-editor; with a tutorial being worked on
es: La ventana principal de &ktutorial-editor; con un tutorial en el que se está trabajando

source: &ktutorial-editor; Main Window
es: Ventana principal de &ktutorial-editor;

source: Edition dialogs
es: Diálogos de edición

source: There are several edition dialogs, each one to set some property or properties of an element.
es: Hay varios diálogos de edición, sirviendo cada uno para establecer una propiedad o varias propiedades de un elemento.

source: Tutorial edition
es: Edición de tutoriales

source: The tutorial information dialog is used to set the name and description of a tutorial. The name and description are mandatory properties, as through the name the user can identify a tutorial and with the description he can know the purpose of the tutorial.
es: El diálogo de información del tutorial se utiliza para establecer el nombre y la descripción de un tutorial. El nombre y la descripción son propiedades obligatorias, ya que mediante el nombre el usuario puede identificar un tutorial y con la descripción puede saber de qué va el tutorial.

source: The dialog to set the name and description of a tutorial
es: El diálogo para establecer el nombre y la descripción de un tutorial

source: Tutorial information edition dialog
es: Diálogo de edición de la información de un tutorial

source: The license text dialog is used to set a license for the tutorial, for example, if the exported scripted tutorial is going to be distributed with its application. When the tutorial is exported, the license text is automatically wrapped in comments appropriate for the script language. For example, the following license text: <programlisting>The license text, which should be wrapped </programlisting> is exported to Javascript as:
es: El diálogo del texto de licencia se utiliza para establecer la licencia del tutorial, por ejemplo, si el tutorial en script exportado va a ser distribuido con su aplicación. Cuando se exporta el tutorial, el texto de licencia se enmarca automáticamente en comentarios apropiados para el lenguaje de script. Por ejemplo, el siguiente texto de licencia: <programlisting>El texto de licencia, que debería enmarcarse </programlisting> se exporta en Javascript como:

source: /***************************************** * The license text, which should be * * wrapped * *****************************************/
es: /***************************************** * El texto de licencia, que debería * * enmarcarse * *****************************************/

source: The setup and tear down code dialogs just provide a text editor to write the custom code to be executed when the tutorial starts or finishes. Note that you have to provide just the body of the function, as the signature is automatically written when exported. For example, the following setup code: <programlisting>alert("Hello world!");</programlisting> is exported to Javascript as:
es: Los diálogos para el código de inicialización y finalización simplemente proporcionan un editor de texto en el que escribir el código propio que será ejecutado cuando el tutorial comienza o termina. Ten en cuenta que sólo tienes que escribir el cuerpo de la función, ya que la signatura se escribe automáticamente al exportar. Por ejemplo, el siguiente código de inicialización: <programlisting>alert("¡Hola mundo!");</programlisting> se exporta en Javascript como:

source: function tutorialSetup(tutorial) { alert("Hello world!"); }
es: function tutorialSetup(tutorial) { alert("¡Hola mundo!"); }

source: Step edition
es: Edición de pasos

source: The step data dialog is used to set the id and text of a step. The id and text are mandatory properties, as the id is used by other steps to change to this step, and the text is shown to the user to explain him what must be done. Thus, the id must be unique for every step in the same tutorial.
es: El diálogo de datos del paso se utiliza para establecer el identificador y el texto de un paso. El identificador y el texto son propiedades obligatorias, ya que el identificador lo utilizan otros pasos para cambiar a este paso, y el texto se muestra al usuario para explicarle qué se debe hacer. Por tanto, el identificador debe ser único para cada paso que pertenezca al mismo tutorial.

source: Rich text and widget higlighting
es: Texto enriquecido y remarcado de widgets

source: When writing the text of a step you can use the <ulink url="http://doc.trolltech.com/richtext-html-subset.html">supported subset of HTML tags</ulink> or the <ulink url="http://techbase.kde.org/Development/Tutorials/Localization/i18n_Semantics#Semantic_Tags">KDE semantic markup tags</ulink> to enrich the text. For example, <emphasis>&lt;strong&gt;Hello world!&lt;/strong&gt;</emphasis> will appear as <emphasis role="strong">Hello world!</emphasis> when shown in the tutorial.
es: Cuando escribas el texto de un paso puedes utilizar el <ulink url="http://doc.trolltech.com/richtext-html-subset.html">subconjunto de etiquetas HTML soportado</ulink> o las <ulink url="http://techbase.kde.org/Development/Tutorials/Localization/i18n_Semantics#Semantic_Tags">etiquetas de marcado semántico de KDE</ulink> para enriquecer el texto. Por ejemplo, <emphasis>&lt;strong&gt;¡Hola mundo!&lt;/strong&gt;</emphasis> aparecería como <emphasis role="strong">¡Hola mundo!</emphasis> cuando se mostrase en el tutorial.

source: KTutorial also provides a special type of link that highlights the referenced widget in order to be found easily. For example, <emphasis>&lt;a href="widget:theWidgetObjectName"&gt;this is a link&lt;/a&gt;</emphasis> (if the HTML subset is used) or <emphasis>&lt;link url="widget:theWidgetObjectName"&gt;this is a link&lt;/link&gt;</emphasis> (if KDE semantic markup is used) will show <emphasis>this is a link</emphasis> with a link appearance (underlined and with some special color) and, when the link is clicked, the widget with the given object name will be highlighted. Clicking the link again will stop highlighting the widget.
es: KTutorial también proporciona un tipo especial de enlace que remarca el widget al que hace referencia para que pueda encontrarse más fácil. Por ejemplo, <emphasis>&lt;a href="widget:elNombreDeObjetoDelWidget"&gt;esto es un enlace&lt;/a&gt;</emphasis> (si se utiliza el subconjunto de HTML) o <emphasis>&lt;link url="widget:elNombreDeObjetoDelWidget"&gt;esto es un enlace&lt;/link&gt;</emphasis> (si se utiliza el marcado semántico de KDE) mostrará <emphasis>esto es un enlace</emphasis> con la apariencia de un enlace (subrayado y de algún color especial) y, cuando se haga click en el enlace, se remarcará el widget con el nombre de objeto indicado. Haciendo click de nuevo en el enlace detendrá el remarcado del widget.

source: To ease all these things, &ktutorial-editor; provides several buttons in the step data dialog that help writing KDE semantic markup tags. These buttons insert the start and end tags for an element as needed, and are enabled or disabled based on the position of the cursor in the text. For example, the button to insert a paragraph tag will be disabled if the cursor is inside a link, but the button to insert a link tag will be enabled if the cursor is inside a paragraph.
es: Para hacer más fácil todo esto, &ktutorial-editor; proporciona varios botones en el diálogo de datos del paso que ayudan a escribir etiquetas de marcado semántico de KDE. Estos botones insertan las etiquetas de apertura y cierre de un elemento según sea necesario, y están habilitados o deshabilitados según la posición del cursor en el texto. Por ejemplo, el botón para insertar una etiqueta de párrafo estará deshabilitado si el cursor está dentro de un enlace, pero el botón para insertar una etiqueta de enlace estará habilitado si el cursor está dentro de un párrafo.

source: The step data dialog is also shown when a new step is added. If the dialog is accepted, the step is added. If the dialog is cancelled, the step is not added.
es: El diálogo de datos del paso se muestra también cuando se añade un nuevo paso. Si se acepta el diálogo, el paso se añade. Si se cancela el diálogo, el paso no se añade.

source: Also note that, in every tutorial, there must be one step with id <emphasis>start</emphasis>, so KTutorial knows where to start the tutorial.
es: Ten en cuenta también que, en todos los tutoriales, debe haber un paso con el identificador <emphasis>start</emphasis>, para que KTutorial sepa dónde empieza el tutorial.

source: The dialog to set the id and text of a step
es: El diálogo para establecer el identificador y el texto de un paso

source: Step data edition dialog
es: Diálogo de edición de los datos de un paso

source: The setup and tear down code dialogs behave like the tutorial ones. The only difference is that the code is executed when the tutorial changes to the step or when the tutorial changes from this step to another one.
es: Los diálogos del código de inicialización y finalización funcionan como los del tutorial. La única diferencia es que el código se ejecuta cuando el tutorial cambia a este paso o cuando el tutorial cambia desde este paso a otro.

source: Also note that the exported scripted tutorial creates all the reactions in the setup method of a step. The custom setup code is added after that code.
es: Ten en cuenta también que el tutorial en script exportado crea todas las reacciones en el método de inicialización del paso. El código propio de inicialización se añade tras ese código.

source: Reaction edition
es: Edición de reacciones

source: The reaction dialog is used to set the trigger and response of a reaction. The trigger and response are mandatory properties, as they define how the reaction behaves.
es: El diálogo de reacciones se utiliza para establecer el activador y la respuesta de una reacción. El activador y la respuesta son propiedades obligatorias, ya que definen el funcionamiento de la reacción.

source: The trigger can be either an option selected or a condition met, but not both. If the trigger type is the option, its name will be shown to the user in the step and the response will be executed when the user selects it. If the type is the condition, the response will be executed when the condition is met.
es: El activador puede ser tanto una opción seleccionada o una condición cumplida, pero no ambas. Si el tipo de la reacción es la opción, su nombre se mostrará al usuario en el paso y la respuesta se ejecutará cuando el usuario la seleccione. Si el tipo es la condición, la respuesta se ejecutará cuando se cumpla la condición.

source: Likely, the response can be changing to another step or executing some custom code, but not both. If the response type is the custom code, it will be used as the body of a function called when the reaction is triggered. Again, the signature of the function is automatically provided and you have to set only the body.
es: De manera similar, la respuesta puede ser cambiar a otro paso o ejecutar cierto código propio, pero no ambas. Si el tipo de la respuesta es el código propio, se utilizará como el cuerpo de la función llamada cuando se active la reacción. De nuevo, la signatura de la función se añade automáticamente y sólo tienes que establecer el cuerpo.
