Repository: KDE/ktutorial
Catalog: ktutorial-editor/doc/*/ktutorial-editor-handbook.po
Languages: es

source: The text completion uses the standard KDE text completion system, so all the standard keyboard shortcuts can be used (like <keycombo action="simul">&Ctrl;<keycap>T</keycap></keycombo> to show all the available completions).
es: El completado de texto utiliza el sistema de completado de texto estándar de KDE, por lo que se pueden usar todos los atajos de teclado estándar (como <keycombo action="simul">&Ctrl;<keycap>T</keycap></keycombo> para mostrar todas las propuestas de completado disponibles).

source: An example of text completion for a signal name
es: Un ejemplo de completado de texto para el nombre de una señal

source: Signal name completion
es: Completado del nombre de una señal

source: Saving and loading again the tutorial
es: Guardar y cargar de nuevo el tutorial

source: &ktutorial-editor; supports saving a tutorial being designed so it can be loaded later to continue working on it. To do this, just use the standard <menuchoice><guimenu>File</guimenu><guimenuitem>Save</guimenuitem></menuchoice> and <menuchoice><guimenu>File</guimenu><guimenuitem>Open...</guimenuitem></menuchoice> menu entries.
es: &ktutorial-editor; permite guardar un tutorial que se está diseñando para poder cargarlo más adelante y seguir trabajando en él. Para hacer esto, simplemente utiliza las entradas de menú estándar <menuchoice><guimenu>Archivo</guimenu><guimenuitem>Guardar</guimenuitem></menuchoice> y <menuchoice><guimenu>Archivo</guimenu><guimenuitem>Abrir...</guimenuitem></menuchoice>.

source: Note that tutorials are saved in an XML format specific to &ktutorial-editor;. A tutorial saved by &ktutorial-editor; can not be used in KTutorial. The tutorial must be <link linkend="export-tutorial">exported</link> before KTutorial can understand it.
es: Ten en cuenta que los tutoriales se guardan en un formato XML específico de &ktutorial-editor;. No se puede utilizar un tutorial guardado por &ktutorial-editor; en KTutorial. El tutorial debe <link linkend="export-tutorial">exportarse</link> para que KTutorial pueda entenderlo.

source: Also note that loading and saving a tutorial does not need to be done from or to a local file. Both the dialog to open a tutorial and the dialog to save it support remote directories (via <acronym>FTP</acronym>, <acronym>SSH</acronym>, etc).
es: Ten en cuenta también que cargar y salvar un tutorial no tiene por qué hacerse desde o a un archivo local. Tanto el diálogo para abrir un tutorial como el diálogo para guardarlo pueden trabajar con directorios remotos (mediante <acronym>FTP</acronym>, <acronym>SSH</acronym>, etc).

source: When a tutorial is loaded or saved it is added to the recently used file list. <menuchoice><guimenu>File</guimenu><guimenuitem>Open Recent</guimenuitem></menuchoice> provides a quick way to load a recently used tutorial from that list.
es: Cuando se carga o guarda un tutorial éste se añade a la lista de archivos usados recientemente. <menuchoice><guimenu>Archivo</guimenu><guimenuitem>Abrir reciente</guimenuitem></menuchoice> proporciona una forma rápida de cargar un tutorial usado recientemente de dicha lista.

source: Exporting the tutorial
es: Exportación del tutorial

source: Once you have finished designing the tutorial you can export it to a scripted tutorial. To do this, just use <menuchoice><guimenu>File</guimenu><guimenuitem>Export...</guimenuitem></menuchoice>, select where to save the file and you are done. Remember that you have to export the file to some specific directory to be found by KTutorial, as explained in <xref linkend="understanding-ktutorial"/>.
es: Una vez que hayas terminado de diseñar el tutorial puedes exportarlo a un tutorial en script. Para hacer esto, simplemente utiliza <menuchoice><guimenu>Archivo</guimenu><guimenuitem>Exportar...</guimenuitem></menuchoice>, selecciona dónde salvar el archivo y listo. Recuerda que tienes que exportar el archivo a unos directorios concretos para que pueda encontrarlo KTutorial, como se explica en <xref linkend="understanding-ktutorial"/>.

source: The export dialog also supports exporting to remote directories, although it will be very strange that you need to use that.
es: El diálogo de exportación también permite exportar a directorios remotos, aunque sería muy extraño que necesitases hacer eso.

source: Command Line Options
es: Opciones de la línea de órdenes

source: Though &ktutorial-editor; will be usually started from the &kde; program menu, or a desktop icon, it can also be opened from the command line prompt of a terminal window. There are a few options that are available when doing this.
es: Aunque &ktutorial-editor; se arrancará generalmente desde el menú de programas de &kde;, o desde un icono de escritorio, puede abrirse también desde la línea de órdenes de una terminal. Hay unas pocas opciones disponibles en este caso.

source: Apart from generic &kde; command line options, &ktutorial-editor; optionally accepts an URL to load a tutorial from it:
es: Además de las opciones de línea de órdenes genéricas de &kde;, &ktutorial-editor; acepta de manera opcional una URL desde la que cargar un tutorial:

source: The URL does not need to be a local file; remote directories are also supported.
es: La URL no necesita ser de un archivo local; también se permiten directorios remotos.

source: Default &kde; Command Line Options
es: Opciones por defecto de &kde; de la línea de órdenes

source: The following command line help options are available:
es: Las siguientes opciones de ayuda en la línea de órdenes están disponibles:

source: This lists the most basic options available at the command line.
es: Lista las opciones más básicas disponibles en la línea de órdenes.

source: This lists the options available for changing the way &ktutorial-editor; interacts with &Qt;.
es: Lista las opciones disponibles para cambiar la forma en que &ktutorial-editor; interacciona con &Qt;.

source: This lists the options available for changing the way &ktutorial-editor; interacts with &kde;.
es: Lista las opciones disponibles para cambiar la forma en que &ktutorial-editor; interacciona con &kde;.

source: This lists all of the command line options.
es: Lista todas las opciones de la línea de órdenes.

source: Lists &ktutorial-editor;'s author in the terminal window.
es: Lista los autores de &ktutorial-editor; en la terminal.

source: Lists version information for &Qt;, &kde;, and &ktutorial-editor;. Also available through <command>ktutorial-editor <option>-v</option></command>.
es: Lista la información de versión de &Qt;, &kde;, y &ktutorial-editor;. También disponible mediante <command>ktutorial-editor <option>-v</option></command>.

source: Shows &ktutorial-editor;'s license text in the terminal window.
es: Muestra el texto de la licencia de &ktutorial-editor; en la terminal.
