Repository: KDE/ktutorial
Catalog: ktutorial-editor/doc/*/ktutorial-editor-handbook.po
Languages: es

source: The dialog to set the trigger and response of a reaction
es: El diálogo para establecer el activador y la respuesta de una reacción

source: Set reaction data edition dialog
es: Diálogo de edición para establecer los datos de una reacción

source: Condition edition
es: Edición de condiciones

source: The condition that acts as a trigger of a reaction can be a simple condition or a composed condition. Simple conditions wait for something to happen, like a signal emitted by an object. Composed conditions wait for its child conditions. For example, waiting until a signal is emitted by an object or an event is received in another object, whatever comes first.
es: La condición que actúa como activador de una reacción puede ser una condición simple o compuesta. Las condiciones simples esperan a que ocurra algo, como una señal emitida por un objeto. Las condiciones compuestas esperan por sus condiciones hijas. Por ejemplo, esperar hasta que un objeto emita una señal o hasta que otro objeto reciba un evento, lo que ocurra primero.

source: Due to this, conditions are represented in a tree, and it also affects how they are edited.
es: Debido a esto, las condiciones se representan como un árbol, y también a la manera en que son editadas.

source: A condition can be added as the root condition when there are no other conditions set, or as a child of the selected composed condition, but not when a simple condition is selected. When a new condition is added, you must select its type. Note that the type of the condition can not be changed later, you will have to remove the condition and set a new one.
es: Una condición puede añadirse como la condición raíz cuando no hay ninguna otra condición establecida, o como un hijo de la condición compuesta seleccionada, pero no cuando una condición simple está seleccionada. Cuando se añade una nueva condición, debes seleccionar su tipo. Ten en cuenta que el tipo de la condición no puede cambiarse luego, tendrás que eliminar la condición y establecer una nueva.

source: The dialog to select the type of the new condition to add
es: El diálogo para seleccionar el tipo de la nueva condición a añadir.

source: New condition dialog
es: Diálogo de nueva condición

source: Only simple conditions (waiting for an event, waiting for a signal, waiting for a window to be shown and waiting for a property to have certain value) can be edited, showing specific dialogs for it. Composed conditions only group other conditions, so they don't have properties to be edited. The condition to wait for its step to be activated, despite being a simple condition, can not be edited either.
es: Sólo las condiciones simples (esperar por un evento, esperar por una señal, esperar a que se muestre una ventana y esperar a que una propiedad tenga cierto valor) pueden editarse, lo que muestra diálogos específicos para ello. Las condiciones compuestas sólo agrupan otras condiciones, por lo que no tienen propiedades que editar. La condición para esperar a que se active su paso, a pesar de ser una condición simple, tampoco puede ser editada.

source: Any condition can be removed from its parent composed condition, or from the reaction if it is the root condition.
es: Cualquier condición puede eliminarse de la condición compuesta que la contiene, o de la reacción si es la condición raíz.

source: There is a special type of condition that verifies that its negated condition wasn't met which purpose is to be used only as a child of a composed condition that waits until all its child conditions were met. The idea is that, when the negated condition wasn't met, the special condition is met. When the negated condition is met, the special condition is no longer met. It can be used, for example, to make a reaction wait for the user to write something in a text line, provided he has not pressed a button before. Note that a fallback reaction should be added in cases like this one.
es: Hay un tipo especial de condición que verifica que su condición negada no se cumplió cuyo propósito es ser usada sólo como hija de una condición compuesta que espera hasta que todas sus condiciones hijas se cumplieron. La idea es que, cuando la condición negada no se cumplió, la condición especial sí está cumplida. Cuando se cumple la condición negada, la condición especial deja de estar cumplida. Puede utilizarse, por ejemplo, para hacer que una reacción espere a que el usuario escriba algo en una línea de texto, pero sólo si no presionó un botón antes. Ten en cuenta que en casos como éste debe añadirse una reacción que pueda cumplirse si la otra no.

source: Conditions and modal dialogs
es: Condiciones y diálogos modales

source: Modal dialogs are those that block the interaction with the windows of the application under them (for example, an error message). When a modal dialog is shown by the application after the user clicks a button, the condition to wait for must be the dialog being shown, but never the button being clicked. The reason has to do with Qt's internals and it is out of the scope for this document.
es: Los diálogos modales son aquellos que impiden la interacción con las ventanas de la aplicación que están debajo de ellos (por ejemplo, un mensaje de error). Cuando la aplicación muestra un diálogo modal después de que el usuario haga click en un botón, la condición por la que esperar debe ser que se muestre el diálogo, pero nunca que se haga click en el botón. Esto se debe a cuestiones internas de Qt que están fuera del ámbito de este documento.

source: Take, for example, an <emphasis>Open file</emphasis> dialog. If the condition to change to the next step is waiting for the <function>clicked()</function> signal to be emitted by the button that shows the dialog, the step will freeze until the <emphasis>Open file</emphasis> dialog is closed, and then it will change to the next step. Instead, the condition to change to the next step must be waiting for the <emphasis>Open file</emphasis> dialog to be shown.
es: Considera, por ejemplo, el diálogo <emphasis>Abrir archivo</emphasis>. Si la condición para cambiar al siguiente paso es esperar a que el botón que muestra el diálogo emita la señal <function>clicked()</function> el paso se congelará hasta que se cierre el diálogo <emphasis>Abrir archivo</emphasis>, y entonces será cuando cambie al siguiente paso. En vez de eso, la condición para cambiar al siguiente paso debe ser esperar a que se muestre el diálogo <emphasis>Abrir archivo</emphasis>.

source: The condition to wait for windows to be shown supports both windows and dialogs, so whenever a window or dialog is shown you can safely use that condition without worrying about whether it is a window, a modal dialog or a modeless dialog.
es: La condición para esperar a que se muestren ventanas soporta tanto ventanas como diálogos, así que cuando se muestre una ventana o diálogo puedes usar esa condición tranquilamente sin preocuparte de si es una ventana, un diálogo modal o un diálogo no modal.

source: Interacting with the target application
es: Interactuando con la aplicación objetivo

source: When a tutorial is being designed it is usually necessary to know some internals about the target application of the tutorial. For example, in order to wait for a signal emitted by an object the name of the object must be known. However, it is very unlikely that even the developers of the application know those things by heart.
es: Cuando se está diseñando un tutorial generalmente se necesita saber cosas sobre el funcionamiento interno de la aplicación objetivo del tutorial. Por ejemplo, para esperar por una señal emitida por un objeto debe saberse el nombre del objeto. Sin embargo, es bastante improbable que incluso los desarrolladores de la aplicación sepan esas cosas de memoria.

source: To help with this problem &ktutorial-editor; is able to "talk" with any application using KTutorial to provide the tutorial designer internal information about the target application. For example, it can provide a list with the names of all the objects accessible by KTutorial in the target application.
es: Para ayudar con este problema &ktutorial-editor; es capaz de "hablar" con cualquier aplicación que utilice KTutorial para proporcionar al diseñador del tutorial información sobre el funcionamiento interno de la aplicación objetivo. Por ejemplo, puede proporcionar una lista con los nombres de todos los objetos a los que puede acceder KTutorial en la aplicación objetivo.

source: Note, however, that the intercommunication system between &ktutorial-editor; and KTutorial works only if they were built with D-Bus system support. Don't worry, though, as it would be very unlikely that the packages of your GNU/Linux distribution were not built with D-Bus support, and if you are building it yourself you probably know what all this means ;)
es: Ten en cuenta, no obstante, que el sistema de intercomunicación entre &ktutorial-editor; y KTutorial funciona sólo si ambos se construyeron con soporte para el sistema D-Bus. Pero no te preocupes, ya que sería muy extraño que los paquetes de tu distribución GNU/Linux no hubiesen sido construidos con soporte para D-Bus, y si lo estás construyendo tú mismo posiblemente ya sabes qué significa todo esto ;)

source: Starting the target application
es: Arrancando la aplicación objetivo

source: &ktutorial-editor; requires an instance of the target application to be running in order to talk with it, although that instance must have been launched by &ktutorial-editor; itself.
es: &ktutorial-editor; necesita que haya una instancia de la aplicación objetivo en funcionamiento para poder hablar con ella, aunque dicha instancia debe haber sido lanzada por el propio &ktutorial-editor;.

source: So, how can the target application be started from &ktutorial-editor;? When you execute some action that requires &ktutorial-editor; to talk to the target application a dialog to choose the application is shown to you. The application can be selected from the proposed application list, or the full path to the application can be manually specified.
es: Así que, ¿cómo se puede arrancar la aplicación objetivo desde &ktutorial-editor;? Cuando ejecutes alguna acción para la que &ktutorial-editor; necesite hablar con la aplicación objetivo se te mostrará un diálogo para escoger la aplicación. La aplicación puede seleccionarse de entre las aplicaciones propuestas en la lista, o se puede indicar la ruta completa a la aplicación de manera manual.

source: Note that the application list contains all the known KDE applications in the system, instead of just those that use KTutorial. &ktutorial-editor; will warn you after launching the application if it is not a valid application.
es: Ten en cuenta que la lista de aplicaciones contiene todas las aplicaciones KDE que se conozcan en el sistema, en lugar de sólo aquellas que utilizan KTutorial. &ktutorial-editor; te avisará tras lanzar la aplicación si ésta no es válida.

source: Once a valid target application has been specified it will be used automatically until the tutorial being designed is closed. If the target application instance is closed, &ktutorial-editor; will launch another instance automatically when it needs to talk again to the target application.
es: Una vez que se haya especificado una aplicación objetivo válida se utilizará automáticamente hasta que se cierre el tutorial que se está diseñando. Si se cierra la instancia de la aplicación objetivo, &ktutorial-editor; lanzará otra instancia automáticamente cuando necesite hablar de nuevo con la aplicación objetivo.

source: Choosing an object in the target application
es: Escoger un objeto en la aplicación objetivo

source: When you want to choose an object from the target application a list with all the objects accessible by &ktutorial-editor; in the target application is shown. The name and class of each object is shown in their entry of the list. The list is an hierarchical structure, thus the parent-child relationship between objects is also shown.
es: Cuando quieras escoger un objeto desde la aplicación objetivo se te mostrará una lista con todos los objetos de la aplicación objetivo a los que puede acceder &ktutorial-editor;. El nombre y la clase de cada objeto se muestran en su entrada de la lista. La lista es una estructura jerárquica, por lo que también muestra la relación padre-hijo entre objetos.

source: The list is updated when there are changes in the target application. For example, if a new dialog is shown in the target application, the dialog and all its children will be shown in the list.
es: La lista se actualiza cuando hay cambios en la aplicación objetivo. Por ejemplo, si se muestra un nuevo diálogo en la aplicación objetivo, el diálogo y todos sus hijos se mostrarán en la lista.

source: Usually, the objects used in tutorials are widgets, so when a widget is selected in the list it is highlighted in the target application. Plain objects obviously are not, as they do not have a graphical representation.
es: Por lo general, los objetos que se utilizan en los tutoriales son widgets, por lo que cuando se selecciona un widget en la lista éste se remarca en la aplicación objetivo. Los objetos sencillos obviamente no se remarcan, ya que no tienen representación gráfica.

source: As widgets are the most used objects in tutorials, plain objects can be filtered from the list. In the same way, objects without name can also be filtered. However, some objects may appear in the list even if they should be hidden when they have any descendant that passes the enabled filters.
es: Dado que en los tutoriales los objetos más utilizados son los widgets, los objetos sencillos pueden filtrarse en la lista. Asimismo, también se pueden filtrar los objetos sin nombre. Sin embargo, algunos objetos podrían aparecer en la lista incluso si deberían estar ocultos cuando tienen algún descendiente que sí pasa los filtros activos.

source: When the list with the objects is shown, the rest of the &ktutorial-editor; windows are hidden. It is made to better view the widgets when they are highlighted in the target application. The &ktutorial-editor; windows are shown again once the selection list is closed.
es: Cuando se muestra la lista con los objetos se ocultan las demás ventanas de &ktutorial-editor;. Esto se hace para ver mejor los widgets cuando se remarcan en la aplicación objetivo.

source: Objects with duplicated names
es: Objetos con nombres duplicados

source: Usually, the name of an object in the target application will identify that and only that object. However, sometimes there could be two or more objects with the same name. For example, if there are two or more dialogs opened, there will probably be two or more objects named <literal>Ok button</literal>.
es: Generalmente, el nombre de un objeto en la aplicación objetivo identificará a ese objeto y sólo a ese objeto. Sin embargo, en ocasiones podría haber dos o más objetos con el mismo nombre. Por ejemplo, si hay dos o más diálogos abiertos, probablemente haya dos o más objetos llamados <literal>Ok button</literal>.

source: Therefore, when two or more objects have the same name, they can not be identified by their name alone. Instead, their name must be qualified with the name of one or more ancestor objects. For example, <literal>Configuration dialog/Ok button</literal>. When an object is chosen in the list, &ktutorial-editor; takes care of all this and gets a unique name for the object.
es: Por lo tanto, cuando dos o más objetos tienen el mismo nombre no se les puede identificar utilizando únicamente dicho nombre. En cambio, su nombre debe acompañarse con el nombre de uno o más de sus objetos ancestros. Por ejemplo, <literal>Configuration dialog/Ok button</literal>. Cuando se escoge un objeto en la lista, &ktutorial-editor; se encarga de todo esto y escoge un nombre único para el objeto.

source: Under some circumstances, an object may not have a unique name. When a name represents two or more objects, KTutorial applies a set of ambiguity solving rules. &ktutorial-editor; takes that into account too, and tries to get a name that identifies the chosen object, even if the name is not unique. But, if even after applying the ambiguity solving rules there is no name that identifies just the chosen object, a warning is shown.
es: En según qué circunstancias, un objeto podría no tener un nombre único. Cuando un nombre representa dos o más objetos, KTutorial aplica un conjunto de reglas para resolver la ambigüedad. &ktutorial-editor; también tiene eso en cuenta, e intenta obtener un nombre que identifique al objeto escogido, incluso si el nombre no es único. Pero, si incluso tras aplicar las reglas para resolver la ambigüedad no hay ningún nombre que identifique sólo al objeto escogido, se mostrará un aviso.

source: However, note that a name and the object it represents depends on the state of the target application. For example, if there is a dialog named <literal>Configuration dialog</literal> with a button named <literal>Ok button</literal>, its unique name could be just <literal>Ok button</literal>. However, if another dialog named <literal>File information dialog</literal> were opened while the <literal>Configuration dialog</literal> was still opened, and <literal>File information dialog</literal> had a also button called <literal>Ok button</literal>, now the unique name of the first button would be <literal>Configuration dialog/Ok button</literal>. In this situation, <literal>Ok button</literal> would not represent a specific object in the target application.
es: No obstante, ten en cuenta que el nombre y el objeto al que representa dependen del estado de la aplicación objetivo. Por ejemplo, si hay un diálogo llamado <literal>Configuration dialog</literal> con un botón llamado <literal>Ok button</literal>, su nombre único podría ser simplemente <literal>Ok button</literal>. Sin embargo, si se abriese otro diálogo llamado <literal>File information dialog</literal> cuando el diálogo <literal>Configuration dialog</literal> estuviese abierto, y el diálogo <literal>File information dialog</literal> tuviese también un botón llamado <literal>Ok button</literal>, ahora el nombre único del primer botón sería <literal>Configuration dialog/Ok button</literal>. En esta situación, <literal>Ok button</literal> no representaría a un objeto específico en la aplicación objetivo.

source: All that means that, when choosing an object from the target application, the target application should be in the same state as it would be when following the tutorial and getting to the current step.
es: Todo esto quiere decir que, cuando se seleccione un objeto de la aplicación objetivo, la aplicación objetivo debería estar en el mismo estado en que estará cuando se siga el tutorial y se llegue al paso actual.

source: Testing a tutorial in the target application
es: Probar un tutorial en la aplicación objetivo

source: Designing a tutorial is not a failproof task. Maybe your custom code does not work as expected, or you are not waiting for the right signal to be emitted, or you forgot some step, or... so the tutorial will have to be tested at least once, but more likely several times.
es: El diseño de un tutorial no es una tarea libre de errores. Puede que tu código propio no funcione como esperabas, o que no estés esperando a que se emita la señal adecuada, o que olvidases cierto paso, o... por lo que el tutorial tendrá que probarse al menos una vez, pero más probablemente varias veces.

source: Exporting the tutorial to the application data directory and then starting the target application each time you want to test the tutorial can be very tedious. To ease testing the tutorial, &ktutorial-editor; is able to start the tutorial being designed directly in the target application. The tutorial can be started from the beginning or from the currently selected step.
es: Exportar el tutorial al directorio de datos de la aplicación y luego arrancar la aplicación objetivo cada vez que quieras probar el tutorial puede ser muy tedioso. Para hacer más fácil probar el tutorial, &ktutorial-editor; es capaz de empezar el tutorial que se está diseñando directamente en la aplicación objetivo. El tutorial puede empezarse desde el principio o desde el paso seleccionado actualmente.

source: Note, however, that after closing the tutorial the target application will know nothing about it. You will have to use the test action in &ktutorial-editor; to start it again, or <link linkend="export-tutorial">export</link> it to a directory known by KTutorial if you want to start it from the application itself.
es: Ten en cuenta, sin embargo, que una vez cerrado el tutorial la aplicación objetivo no sabrá nada de él. Tendrás que usar la acción para probar de &ktutorial-editor; para empezarlo de nuevo., o <link linkend="export-tutorial">exportarlo</link> a un directorio conocido por KTutorial si quieres empezarlo desde la aplicación misma.

source: Other less noticeable features
es: Otras características menos evidentes

source: Besides those already mentioned, &ktutorial-editor; uses a running target application to provide other small yet useful features.
es: Además de las ya mencionadas, &ktutorial-editor; utiliza una aplicación objetivo en funcionamiento para proporcionar otras pequeñas aunque igualmente útiles características.

source: The one-line text editors to set the name of an object have text completion, so if instead of choosing the object its name is written directly in the text editor it will suggest the name based on the objects in the target application. The completion will try to suggest unique names; however, two or more proposed names can be duplicated if the objects they represent do not have a unique name, even after applying the ambiguity solving rules.
es: Los editores de texto de una única línea para establecer el nombre de un objeto cuentan con completado de texto, por lo que si en lugar de escoger el objeto se escribe su nombre directamente en el editor de texto éste sugerirá el nombre en base a los objetos de la aplicación objetivo. El completado procurará sugerir nombres únicos; sin embargo, dos o más de los nombres propuestos podrían estar duplicados si los objetos a los que representan no tienen un nombre único, incluso tras haber aplicado las reglas para resolver la ambigüedad.

source: The one-line text editor to set the name of a signal also has text completion, so when the object name was set, the text editor will suggest the signal name based on the signals that can be emitted by that object. The same schema is used for the name of properties.
es: Los editores de texto de una única línea para establecer el nombre de una señal también tienen completado de texto, por lo que una vez que se establece el nombre del objeto, el editor de texto sugerirá el nombre de la señal en base a las señales que pueden ser emitidas por ese objeto. El nombre de las propiedades sigue este mismo esquema.

source: The one-line text editors for step ids in the step data and reaction dialogs have text completion too. The first one will suggest the ids not assigned yet (from the <emphasis>change to step</emphasis> field of the reactions), and the second one will suggest the ids already set in the steps.
es: Los editores de texto de una única línea para identificadores de pasos en los diálogos de datos del paso y de reacciones también tienen completado de texto. El primero sugerirá los identificadores que no fueron asignados todavía (del campo <emphasis>cambiar al paso</emphasis> de las reacciones), y el segundo sugerirá los identificadores ya establecidos en los pasos.
