Repository: KDE/ktutorial
Catalog: ktutorial-test-app/po/*.po
Languages: es

# @title
source: Test application for <application>KTutorial</application>
es: Aplicación de prueba para <application>KTutorial</application>

# @title
source: A simple test application for <application>KTutorial</application>.
es: Una sencilla aplicación de prueba para <application>KTutorial</application>.

# @info:credit
source: Copyright (c) 2008 KDE TechBase Developers
es: Copyright (c) 2008 Desarrolladores de KDE TechBase

# @info
source: Code borrowed from <link>http://techbase.kde.org/index.php?title=Development/Tutorials/Saving_and_loading</link>
es: Código cogido prestado de <link>http://techbase.kde.org/index.php?title=Development/Tutorials/Saving_and_loading</link>

# @info:credit
source: KTutorial integration and tutorials
es: Integración con KTutorial y tutoriales

source: Main Toolbar
es: Barra de herramientas principal

# NAME OF TRANSLATORS
source: Your names
es: Daniel Calviño Sánchez

# EMAIL OF TRANSLATORS
source: Your emails
es: danxuliu@gmail.com

# @action
source: Clear
es: Limpiar

source: Clear the text area
es: Limpiar el área de texto

source: This tutorial shows how to clean the text area with ease
es: Este tutorial muestra cómo limpiar el área de texto con facilidad

source: Hello world
es: Hola mundo

# @info
source: In this tutorial you will learn how to clear text in the test application.<nl/>First, write "%1" (without quotes) in the text area
es: En este tutorial aprenderás cómo limpiar el texto en la aplicación de prueba.<nl/>Primero, escribe "%1" (sin las comillas) en el área de texto

# @info
source: Now, you must trigger the clear action.<nl/>To do this, you can click in <interface>File|Clear</interface>, or in the toolbar button called <interface>Clear</interface>
es: Ahora, debes activar la acción de Limpiar.<nl/>Para hacer esto, puedes hacer click en <interface>Archivo|Limpiar</interface>, o en el botón de la barra de herramientas llamado <interface>Limpiar</interface>.

# @info
source: And that's all.<nl/>Now you can close the tutorial.
es: Y eso es todo.<nl/>Ahora puedes cerrar el tutorial.

source: Move text in the text area
es: Mover texto en el área de texto

source: This tutorial shows how to move text in the text area
es: Este tutorial muestra cómo mover texto en el área de texto

# @info
source: In this tutorial you will learn how to move text in the test application.<nl/>Text can be moved using the mouse or the keyboard. What do you prefer?
es: En este tutorial aprenderás cómo mover texto en la aplicación de prueba.<nl/>El texto puede moverse utilizando el ratón o el teclado. ¿Qué prefieres?

source: Mouse
es: Ratón

source: Keyboard
es: Teclado

# @info
source: First of all, clean the text area and write "%1" (without quotes)
es: Lo primero de todo, limpia el área de texto y escribe "%1" (sin comillas)

source: world
es: mundo

# @info
source: Now, select the text "%1" in the text area
es: Ahora, selecciona el texto "%1" en el área de texto

# @info
source: The next thing to do is cut the selected text. Cutting it will remove it from the text area, but in some Steps we will make it appear again. To cut the selected text, click in <interface>Edit|Cut</interface> or in the button of the toolbar
es: Lo siguiente es cortar el texto seleccionado. Al cortarlo se eliminará del área de texto, pero dentro de unos pasos lo haremos aparecer de nuevo. Para cortar el texto seleccionado, haz click en <interface>Editar|Cortar</interface> o en el botón de la barra de tareas

source: Hello
es: Hola

# @info
source: Move the cursor to the beginning of the document, before "%1" text
es: Mueve el cursor al principio del documento, antes del texto "%1"

# @info
source: Finally, paste the text you have cut previously. To do this, click in <interface>Edit|Paste</interface> or in the button in the toolbar
es: Finalmente, pega el texto que cortaste previamente. Para hacer esto, haz click en <interface>Editar|Pegar</interface> o en el botón de la barra de herramientas

# @info
source: Press with the left button of the mouse on the selected text. You must press on it, or the selection will change, and you will have to select it again. Don't release the button yet.
es: Pulsa con el botón izquierdo del ratón en el texto seleccionado. Debes pulsar sobre él, o la selección cambiará, y deberás seleccionarlo de nuevo. No sueltes el botón aún.

# @info
source: Without releasing the mouse button, move the cursor to the desired position, for example the beginning of the text.<nl/>Once the cursor is there, you can release the mouse button, and the text will be moved.
es: Sin soltar el botón del ratón, mueve el cursor a la posición deseada, por ejemplo el principio del texto.<nl/>Una vez que el cursor esté ahí, puedes soltar el botón del ratón, y el texto será movido.

# @info
source: As explained, there are two ways to move text in a text area: using the mouse and using the keyboard. Do you want to see the other way?
es: Como se dijo, existen dos formas de mover el texto en un área de texto: usando el ratón y usando el teclado. ¿Quieres ver la otra forma?

source: Yes, please
es: Sí, por favor

source: No, thanks
es: No, gracias

# @info
source: That's all.<nl/>Now you can close the tutorial.
es: Y eso es todo.<nl/>Ahora puedes cerrar el tutorial.

# @info
source: <para><emphasis>Warning:</emphasis> due to <link url="https://bugs.kde.org/show_bug.cgi?id=219787">Kross bug 219787</link>, this step will crash KTutorial test app. Hopefully, soon the patch given in the bug will be applied and there will be no more crashes ;)</para><para>If you are wondering why a tutorial that crashes was included in KTutorial test app, the answer is because although it crashes, it also contains examples of advanced tutorial scripting using Python.</para><para>Press with the left button of the mouse on the selected text. You must press on it, or the selection will change, and you will have to select it again. Don't release the button yet.</para>
es: <para><emphasis>Atención:</emphasis> debido al <link url="https://bugs.kde.org/show_bug.cgi?id=219787">bug 219787 de Kross</link>, este paso hará que la aplicación de prueba de KTutorial casque. Con suerte, pronto se aplicará el parche indicado en el bug y dejará de cascar ;)</para><para>Si te preguntas por qué se incluyó un tutorial que casca en la aplicación de prueba de KTutorial, la respuesta es porque aunque casca, también contiene ejemplos de tutoriales en script avanzados usando Python.</para><para>Pulsa con el botón izquierdo del ratón en el texto seleccionado. Debes pulsar sobre él, o la selección cambiará, y deberás seleccionarlo de nuevo. No sueltes el botón aún.</para>
